{
  "20240101_173119.jpg": [
    [
      "20240101_173642 (1).jpg",
      "The image is ironic, because even when there are steel frame baskets are available at the supermarkets people prefer carrying the items in hand"
    ],
    [
      "20240101_181138.jpg",
      "The image is ironic, because the person in the first image is trying to explain about some content posted by it and in the second image the people in the comment section has misinterpreted the posted and are declaring or criticising it as an offensive joke rather than knowing the real meaning or logic behind the post"
    ]
  ],
  "20240101_173927.jpg": [
    [
      "20240101_173718.jpg",
      "The image just speaks yes, but in a different way as \"yes, butt\" like in the early morning the man had to look at the cat's butt because it is standing over the man's body"
    ],
    [
      "20240101_173010.jpg",
      "The image is funny because while there is a big discount on the shoes inticing customer to buy them, the only available sizes are 35 and 47 which are the smalles and the largest meaning that a majority of the people can not buy the shoe because they won't fit."
    ]
  ],
  "20240101_174237.jpg": [
    [
      "20240101_174654.jpg",
      "The images are funny since it shows how even a mighty king must do simple things like using a toilet just like everyone else does"
    ],
    [
      "20240101_173123.jpg",
      "The image is funny, as the person has a ticket of a seat that is on the leftmost end of the gallery. However, the person has entered from the other end, and is going through a sea of seated people to get to the vacant seat. This would cause inconvenience to the people in the row, and would probably take a longer time to reach the seat."
    ]
  ],
  "20240101_175847.jpg": [
    [
      "20240101_180032.jpg",
      "The images are funny since they show how people are more worried about small damages to  things they can replace like cars but are not worried about permanent damages to their own health"
    ],
    [
      "20240101_175331.jpg",
      "The dog owners take their dogs for some walk in parks but their dogs mingle together with other dogs however their leashes get entangled during this which is quite inconvenient for the dog owners"
    ]
  ],
  "20240101_181411.jpg": [
    [
      "20240101_181316.jpg",
      "The images are funny since even though a cat tree is bought for cats to play with, cats would usually rather play with inexpensive cardboard boxes because they enjoy it more"
    ],
    [
      "20240101_180958.jpg",
      "The images are funny since even it shows how even though modern cars are fitted with features like reverse camera, drivers still choose to not use it and reverse the old fashioned way by looking behind"
    ]
  ],
  "20240101_175107.jpg": [
    [
      "20240101_180802.jpg",
      "The image is ironic, because in the left image the man is showing love and care for the puppy but in the right image the same puppy is shown to be chained in a kennel, which shows dual nature of human towards animals"
    ],
    [
      "20240101_182511.jpg",
      "The image is ironic, because in the second image it is shown that a group of people is attending someone's death ceremony but one of them is shown as wrongly dressed for that place in first image, his visual appearances doesn't shows his feeling of mourning"
    ]
  ],
  "20240101_175803.jpg": [
    [
      "20240101_174757.jpg",
      "The images are funny since it shows a woman simply sipping from a cup at ease in a cafe with her laptop not caring about anything going on outside the cafe even though the situation is very grave,that is, a nuclear blast"
    ],
    [
      "20240101_174719.jpg",
      "The image is ironic, because even when the pigeon has wings to fly it is walking even when it seems threatening to its life"
    ]
  ],
  "20240101_175820.jpg": [
    [
      "20240101_173706.jpg",
      "The image is ironic, because even after when the skateboard scooters are available for someone to ride but the road has many potholes that it is not suitable to ride the scooters on such roads"
    ],
    [
      "20240101_181138.jpg",
      "The image is ironic, because the person in the first image is trying to explain about some content posted by it and in the second image the people in the comment section has misinterpreted the posted and are declaring or criticising it as an offensive joke rather than knowing the real meaning or logic behind the post"
    ]
  ],
  "20240101_172354.jpg": [
    [
      "20240101_180345.jpg",
      "The image is ironic, because the person has to travel 2 hours just to ride his bicycle for 17 minutes"
    ],
    [
      "20240101_173214.jpg",
      "The image is funny and showing a common problem with microsoft paint like applications where even a slight openings in the shapes causes entire drawing to be filled with the same color when using the fill color option. In this case, the person using the application intended to color only the ceiling of the house to brick red but ended up coloring the whole drawing with the brick red color."
    ]
  ],
  "20240101_173813.jpg": [
    [
      "20240101_172354.jpg",
      "The image is ironical, as the t-shirt says \"We work jobs we hate, to buy sh*t we don't need\", which is a rebellious message against the construct of office jobs. However, the person wearing the t-shirt seems to be working in an office environment. Also, the t-shirt might have been bought using the money earned via the very same job."
    ],
    [
      "20240101_180407.jpg",
      "The images are funny since it show a woman holding a leaf over half of her face for a good photo but unknown to her is thale fact the same leaf might have been defecated or urinated upon by dogs and other wild animals"
    ]
  ],
  "20240101_174241.jpg": [
    [
      "20240101_180952.jpg",
      "The image is funny because while the umbrella helps a person avoid getting wet from rain, when the rain stops and the umbrella is folded, the wet umbrella iteself drips water on the person holding it."
    ],
    [
      "20240101_181146.jpg",
      "This image is funny because a cap is MEANT to protect one's eyes from the sun, but this person is more interested in using it to look stylish, even if it makes them uncomfortable."
    ]
  ],
  "20240101_174719.jpg": [
    [
      "20240101_174927.jpg",
      "The image is ironical, as a woman is sitting by the sink taking a selfie using a mirror, while not using a chair that is actually meant for sitting."
    ],
    [
      "20240101_180155.jpg",
      "The image is ironic, because an old man with good looking clothes, symbolising him as rich, is showing a quote on the difficulty for a rich man to gain eternal life whereas the man has both long life meaning eternal life and good clothes meaning rich"
    ]
  ],
  "20240101_172357.jpg": [
    [
      "20240101_181319.jpg",
      "The image is ironic, because people often use rowing machine at the gym don't prefer rowing when it comes to boats"
    ],
    [
      "20240101_173642 (1).jpg",
      "The image is ironic, because even when there are steel frame baskets are available at the supermarkets people prefer carrying the items in hand"
    ]
  ],
  "Screenshot_2024-01-01-18-15-32-614_com.twitter.android-edit.jpg": [
    [
      "20240101_180751.jpg",
      "The image is ironical, as salad in a bowl by itself is very healthy. However, when people have it with Mayonnaise sauce to improve the taste, it is not healthy anymore, and defeats the point of having nutrient-rich salad altogether."
    ],
    [
      "20240101_175353.jpg",
      "The same sea which gives us a relaxation on a normal day can pose a danger to us sometimes like during a tsunami"
    ]
  ],
  "20240101_173135.jpg": [
    [
      "20240101_173355.jpg",
      "The images are funny since they show how smartphone manufacturers advertise their smartphones to have a high internal storage space but in reality, the amount of space available to an user is considerably less due to pre-installed software"
    ],
    [
      "20240101_181001.jpg",
      "The image is funny because why people like to get whole pies, they only end up eating a small portion of it wasting the rest of the pie."
    ]
  ],
  "20240101_173518.jpg": [
    [
      "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg",
      "The images are funny since even though a woman goes for a full body massage expecting it to soothe her whole body, the design of a massage table is such that no matter how badly her nose itches, she cannot scratch it to soothe herself"
    ],
    [
      "20240101_175353.jpg",
      "The same sea which gives us a relaxation on a normal day can pose a danger to us sometimes like during a tsunami"
    ]
  ],
  "20240101_173936.jpg": [
    [
      "20240101_172936.jpg",
      "This image is funny, as a car is approaching a Y junction, with the left fork empty, and the right fork filled with a line of cars. If it needs to go to the right, it should get behind the line of cars. However, in an attempt to probably go faster, the car tries to cut in line, leading to more traffic,  thereby increasing commute time."
    ],
    [
      "20240101_174853.jpg",
      "The image is ironic, because on the one side tetra packs have cap or lid for opening but on the other side the folded end seems inconvenient to handle"
    ]
  ],
  "20240101_172414.jpg": [
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ],
    [
      "20240101_180032.jpg",
      "The images are funny since they show how people are more worried about small damages to  things they can replace like cars but are not worried about permanent damages to their own health"
    ]
  ],
  "20240101_174813.jpg": [
    [
      "20240101_180332.jpg",
      "The image is ironical, as a bathtub near a window having a very scenic view, becomes misty when someone is bathing, thus making the scenic view blurry."
    ],
    [
      "20240101_174119.jpg",
      "The image is ironical, as the person is believes that \"You Only Live Once\" (as can be seen from the t-shirt), and hence drinks and parties a lot, and is dead probably due to drug overdose. However, it is shown that the person re-incarnates as a crying baby, which goes against the person's belief."
    ]
  ],
  "20240101_175217.jpg": [
    [
      "20240101_172944.jpg",
      "The image is ironic, because the poster of sale at a store is posted 3 days ago on a social media account which means the sale which was for only one day has become over"
    ],
    [
      "20240101_180932.jpg",
      "The image is ironical, as to clear the phone's memory using phone cleaner app, one has to install it, but that is not possible in turn due to the phone memory being full."
    ]
  ],
  "20240101_175730.jpg": [
    [
      "20240101_173112.jpg",
      "The images are ironic since it shows how a holiday destination for a woman and a man is actually a workplace for many others where they are toiling away everyday"
    ],
    [
      "20240101_172348.jpg",
      "The image is ironic, because in the first image a person is seen watching his decorated X-mas tree but in the second image it is shown that the tree is looking beautiful not due to its natural beauty but the bulbs connected via power decorated over it"
    ]
  ],
  "20240101_173159.jpg": [
    [
      "20240101_180649.jpg",
      "The image is funny becuase while folding the side mirrors is good when the car is not being used because it prevents damage but it is supposed to be used while driving and parking the car which has not been done in this case leading the car to be parked impropely."
    ],
    [
      "20240101_172843.jpg",
      "The image is ironic, because the person is seen as applying tape over laptop's camera over some privacy concerns but on the other hand he/she carries the phone without covering its camera"
    ]
  ],
  "20240101_181422.jpg": [
    [
      "20240101_175259.jpg",
      "The image is funny beaucse while the person as a child enjoyed being around cars, had various small toy cars and even rode a bigger toy car, as as grown up he does not enjoy being in a car during a traffic jam while he is driving ."
    ],
    [
      "20240101_173219.jpg",
      "The person's shocks is very dirty although the shoes are very clean. Thus there is an irony that not all things are same as they appear."
    ]
  ],
  "20240101_175738.jpg": [
    [
      "20240101_175231.jpg",
      "The irony here is that people buy phones with flashy camera systems just to click pictures of random and insignificant things."
    ],
    [
      "20240101_175541.jpg",
      "The image is ironical, as the cans of paint used to make graffiti on the theme \"Save the Earth\" seems to be destroying the Earth when it overflows on the grass, as it is harmful for the flora and fauna, as can be seen from the dying insects."
    ]
  ],
  "20240101_174218.jpg": [
    [
      "20240101_174147.jpg",
      "The image is ironic, because in the first image there are many memes on men but in the second image a person is seen raising voice over some meme on woman and calling it as woman bully but no one raises their voice against memes over man calling them as man bully"
    ],
    [
      "20240101_175759.jpg",
      "The image is ironic, because in the first image it shows that someone plan their life in a to-do list but as the future is unknown anyone can never be sure whether he/she can complete their to-do lists"
    ]
  ],
  "20240101_180515.jpg": [
    [
      "20240101_173000.jpg",
      "The image is satirical because the intention of wearing a glove while preparing food is to not let any germs and dirt from our hands get into the food, people do other tasks like collecting money from the customer wearing the same gloves and thus making the gloves themselves dirty."
    ],
    [
      "20240101_175107.jpg",
      "The image is funny, as the bathroom sink looks clean, but when you zoom into the touch power button, you can see fingerprint smudges."
    ]
  ],
  "20240101_173624.jpg": [
    [
      "20240101_175048.jpg",
      "The image is ironical because in the left image it is written eco bag but in the right image we are keeping items of plastic which is not eco-friendly."
    ],
    [
      "20240101_175208.jpg",
      "The image is ironic, because in one image the softy cone is shown filled with softy but in second image it is visible that only the top of the cone is filled and at the inside the cone is vacant"
    ]
  ],
  "20240101_182506.jpg": [
    [
      "20240101_180159.jpg",
      "This image is funny because an eatery that calls itself the \"healthy\" cafe also has a smoking area, which is not very \"healthy\". If it really was a healthy cafe, it would not have a smoking area as smoking is injurious to health. Satire on the behavior of humans - both those that operate this cafe who made the decision of allowing smoking and creating a designated smoking area, and those that visit this healthy cafe to become \"healthy\", but then also indulge in very unhealthy habits simultaneously."
    ],
    [
      "20240101_173419.jpg",
      "The image is ironic, because the phone is not able to capture the real beauty of the view which the viewer can see by their naked eyes"
    ]
  ],
  "20240101_173525.jpg": [
    [
      "20240101_180515.jpg",
      "The image is ironic, because  in the first image the waiter is bringing the dish to the table presenting it as some lavish dish but in the second image when the dish is shown in the plate its just a small piece to eat"
    ],
    [
      "20240101_175847.jpg",
      "the image is funny, as the marking at the top of the packaging shows that you would need a pair of scissors to in-turn cut open the pair of scissors that is inside the packaging."
    ]
  ],
  "20240101_173232.jpg": [
    [
      "20240101_180407.jpg",
      "The images are funny since it show a woman holding a leaf over half of her face for a good photo but unknown to her is thale fact the same leaf might have been defecated or urinated upon by dogs and other wild animals"
    ],
    [
      "20240101_182541.jpg",
      "The images are funny since it shows that even though the polished and colorful long nails look pretty and fashionable, the hinder the masseuse's ability to do her job of providing relaxing massages and hurts her customers"
    ]
  ],
  "20240101_180332.jpg": [
    [
      "20240101_173219.jpg",
      "The person's shocks is very dirty although the shoes are very clean. Thus there is an irony that not all things are same as they appear."
    ],
    [
      "20240101_173921.jpg",
      "The image is funny, as the weather is sunny during the weekdays, which are generally the days when people work in a job. People look forward to go outside and enjoy in the weekend, but due to an unexpected rainy weather, people will not be able to go outside."
    ]
  ],
  "20240101_173245.jpg": [
    [
      "20240101_174021.jpg",
      "The images are ironic since the metallic water bottle aims to be more sustainable as can be seen from the sign on the bottle but its user fills it with a plastic bottle which destroys its purpose"
    ],
    [
      "20240101_173100.jpg",
      "This image is funny because its an assumed expectation that  the dead phone will be rescued by the power bank, but here the power bank is also dead and of no use."
    ]
  ],
  "20240101_172853.jpg": [
    [
      "20240101_182526.jpg",
      "This image may present two different ideas, firstly even she is such a believer in god that she has got a tatto of holy cross symbol on her back but her situations have forced her to do a job at a bar or some place performing pole dance and secondly she is using a religious symbol to glorify her look so that more people acknowledge her dance and give her some money"
    ],
    [
      "20240101_175535.jpg",
      "The images are funny since they show how wearing expensive football boots does not make the user a better footballer. The footballer is still just as bad and it is a waste for him to buy such expensive boots"
    ]
  ],
  "20240101_172322.jpg": [
    [
      "20240101_175413.jpg",
      "This is funny because the pie chart printout is useless as you cant see any divisions on it because the  printer could not capture the different colors"
    ],
    [
      "20240101_180155.jpg",
      "The image is ironic, because an old man with good looking clothes, symbolising him as rich, is showing a quote on the difficulty for a rich man to gain eternal life whereas the man has both long life meaning eternal life and good clothes meaning rich"
    ]
  ],
  "20240101_174753.jpg": [
    [
      "20240101_173712.jpg",
      "The image is ironic, because the left image suggest that a person applies lipsticks on their lips to make their lips look attractive or to keep them hydrated but on the contrary it gets sticked to the glasses or mugs and gets wasted"
    ],
    [
      "20240101_182338.jpg",
      "The image is ironical, as the smartwatch on the person's wrist shows 10,000 steps completed as an accomplishment, while showing later that the person is apparently walking inside a jail as a prisoner."
    ]
  ],
  "20240101_175608.jpg": [
    [
      "20240101_172838.jpg",
      "The image is ironic, as the t-shirt that says \"NONBINARY\" has only 2 options for gender on an online retail forum."
    ],
    [
      "20240101_174029.jpg",
      "The images are ironic since they show how on one hand humans choose to play with and waste foods like vegetables while the animals are unable to eat enough food and end up starving due to lack of food"
    ]
  ],
  "20240101_174654.jpg": [
    [
      "20240101_173647.jpg",
      "The image is ironic, as the person is holding the game console to play a game during the flight. However, the person is unable to play the game, as the game requires internet (as is the case with many modern games), and internet is unavailable in many lights."
    ],
    [
      "20240101_181411.jpg",
      "The image is funny, as one person with a hair dyed blue seems to symbolize that the person is going against the grain, however, when we zoom out, the group of people have hair dyed in several, different colors, showing that, dyeing hair is the new normal."
    ]
  ],
  "20240101_173800.jpg": [
    [
      "20240101_180643.jpg",
      "The image is ironic, because there are many different color currency notes' bundles but they are just as a currency in the game of monopoly and they have no real value"
    ],
    [
      "20240101_175738.jpg",
      "The image is ironic, because a person is seen feeling proud over the profit earned over his investment but the right image shows the whole story how only a small part of his investment journey is shown and the other loss part is ignored"
    ]
  ],
  "20240101_174927.jpg": [
    [
      "20240101_180545.jpg",
      "The image is funny because while the man claims to be vegan, he is biting skin off his own hand."
    ],
    [
      "20240101_173007.jpg",
      "The image is ironical, as the umbrella is meant to provide shadow in the area where the chairs are present, but due to the orientation of the rays of the sun, all the chairs are in sunlight, and the umbrella is of no use in this situation."
    ]
  ],
  "20240101_174737.jpg": [
    [
      "20240101_172731.jpg",
      "Image is funny because the box of salad was marketed in a way that showed a lot more salad content than was really present inside it."
    ],
    [
      "20240101_180851.jpg",
      "The Picture shows that although we enjoy food in garden but there are some consequences of eating food in garden. Many bugs and bees are attracted towards our food and make our food sometimes non-eatable."
    ]
  ],
  "20240101_180319.jpg": [
    [
      "20240101_174708.jpg",
      "The environment is feeling very relaxing in the right image but the consequence is that the food is flying die to powerful wind. So the person is not able to eat it properly."
    ],
    [
      "20240101_180607.jpg",
      "Women wear netted tops while out in the sun on the beach as a beachwear, but when the person removes it, the skin is tanned in the same netted pattern looks weird, and goes against the purpose of using it as beachwear"
    ]
  ],
  "20240101_175231.jpg": [
    [
      "20240101_175353.jpg",
      "The same sea which gives us a relaxation on a normal day can pose a danger to us sometimes like during a tsunami"
    ],
    [
      "20240101_175339.jpg",
      "The image is funny because while the bed seems to be well made with the blanket on top, the actual blanket inside the blanket cover is twisted and not properly set."
    ]
  ],
  "20240101_180844.jpg": [
    [
      "20240101_172417.jpg",
      "The image is ironical, as a person sets a strong password for Wifi, while setting a very simple 4-digit PIN (1234 here) for online banking, where a much higher level of security would be required instead."
    ],
    [
      "20240101_180332.jpg",
      "The image is ironical, as a bathtub near a window having a very scenic view, becomes misty when someone is bathing, thus making the scenic view blurry."
    ]
  ],
  "20240101_175326.jpg": [
    [
      "20240101_173638.jpg",
      "The image is funny because a well-built person wearing an aggressive tank-top with the word \"KILL\" on an image of a skull is having very childish flavours of whey protein such as teddy vanilla, yummy yummy choco, and strawberry vanilla, contrary to the person's external persona. This depicts the metaphor 'Do not judge a book by its cover'."
    ],
    [
      "20240101_175259.jpg",
      "The image is funny beaucse while the person as a child enjoyed being around cars, had various small toy cars and even rode a bigger toy car, as as grown up he does not enjoy being in a car during a traffic jam while he is driving ."
    ]
  ],
  "20240101_175445.jpg": [
    [
      "20240101_182328.jpg",
      "The image is ironic, because people nowadays use eco-bag thinking them as safe for the environment but in turn use products which are harmful for the environment or are packaged in some non-biodegradable material"
    ],
    [
      "20240101_174536.jpg",
      "The image is funny because a person opens a door with the sign 'OPEN', meaning the place is open. However, once the person enters the building and looks back, the other side of the sign reads 'CLOSE', which ideally should not be the case, as the place is actually open."
    ]
  ],
  "20240101_180607.jpg": [
    [
      "20240101_172902.jpg",
      "The images are funny since they show how new hairstyles are closely resembling pattern baldness"
    ],
    [
      "20240101_180618.jpg",
      "The images are funny since they show how a sender wants the recipient to revert once he gets back home but the tired recipient ends up falling asleep completely forgetting about the message while the sender keeps waiting for a reply. The fact that the recipient leaves his phone on silent mode makes it even funnier since the probability of the sender being able to contact him becomes even slimmer."
    ]
  ],
  "20240101_175647.jpg": [
    [
      "20240101_181439.jpg",
      "The image is ironical, as having breakfast in bed is a luxury. However, eating while in bed leads to food crumbs, making the bed dirty, along with the need to clean the bed afterwards."
    ],
    [
      "20240101_182552.jpg",
      "The image is funny because while the food for the dog that the woman pours is well balanced, the food that she herself is eating is bad for her health."
    ]
  ],
  "20240101_181319.jpg": [
    [
      "20240101_175627.jpg",
      "The image is funny, as the person is trying to operate the tap, but water comes out of the handheld shower resting on a holder instead of the tap, making the person drenched in water."
    ],
    [
      "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg",
      "The images are funny since even though a woman goes for a full body massage expecting it to soothe her whole body, the design of a massage table is such that no matter how badly her nose itches, she cannot scratch it to soothe herself"
    ]
  ],
  "20240101_173210.jpg": [
    [
      "20240101_174737.jpg",
      "The image is ironic, because in the first image the woman is seen as enjoying the view but in the second image the same woman is seen as looking at a pooping dog"
    ],
    [
      "20240101_175759.jpg",
      "The image is ironic, because in the first image it shows that someone plan their life in a to-do list but as the future is unknown anyone can never be sure whether he/she can complete their to-do lists"
    ]
  ],
  "20240101_175353.jpg": [
    [
      "20240101_174225.jpg",
      "The image is ironic because in the first image it is shown that the woman has got salad for her but she is having french fries from the man's plate which displays that the girl is trying to show herself as health conscious by having a plate of salad for her but she wants to have to have fast food but rather than having them for herself she is taking some from other's plate"
    ],
    [
      "20240101_175048.jpg",
      "The image is ironical because in the left image it is written eco bag but in the right image we are keeping items of plastic which is not eco-friendly."
    ]
  ],
  "Screenshot_2024-01-01-17-38-54-117_com.twitter.android-edit.jpg": [
    [
      "20240101_174842.jpg",
      "These images are funny since it shows how we are taught emergency procedures to follow in case of an accident while in an airplane but how none of them work if the plane is still in air"
    ],
    [
      "20240101_173326.jpg",
      "The images are funny since it shows how people tend to forget the important details like names of presidents but remember the useless ones, like forgetting names of presidents but remembering the names of their exes in this example"
    ]
  ],
  "20240101_181138.jpg": [
    [
      "20240101_180515.jpg",
      "The image is ironic, because  in the first image the waiter is bringing the dish to the table presenting it as some lavish dish but in the second image when the dish is shown in the plate its just a small piece to eat"
    ],
    [
      "20240101_175135.jpg",
      "The image is ironic, because even when the signal is green for the pedestrians but they can't cross the road because of the vehicles standing on the zebra crossing"
    ]
  ],
  "20240101_173104.jpg": [
    [
      "20240101_172924.jpg",
      "The irony in the image is that the mug is supposedly cute and quirky but it is completely impractical as a mug as it will hurt its user."
    ],
    [
      "20240101_180026.jpg",
      "The images are ironic since a dog shampoo bottle has a sticker indicating that it has not been tested on animals and hence might not be safe for animal use. It is amusing that a product designed to be used by animals is not tested on animals for their safety"
    ]
  ],
  "20240101_180340.jpg": [
    [
      "20240101_175558.jpg",
      "The image is ironical, as vegan mayo sauce is being poured on rib steak, which is non-vegetarian. The person might as well just use normal mayo sauce instead."
    ],
    [
      "20240101_180618.jpg",
      "The images are funny since they show how a sender wants the recipient to revert once he gets back home but the tired recipient ends up falling asleep completely forgetting about the message while the sender keeps waiting for a reply. The fact that the recipient leaves his phone on silent mode makes it even funnier since the probability of the sender being able to contact him becomes even slimmer."
    ]
  ],
  "20240101_173043.jpg": [
    [
      "20240101_174958.jpg",
      "the irony is that people lock their bikes on poles where anyone can just lift the bike out of the pole"
    ],
    [
      "20240101_173159.jpg",
      "The images are ironic because even though garbage bins are provided for humans to dispose waste, by habit humans still choose to make surroundings dirty by disposing garbage improperly"
    ]
  ],
  "20240101_180856.jpg": [
    [
      "20240101_174055.jpg",
      "The images are funny since they show a man who thinks he has made a great achievement by winning a medal and is proud while everyone around him has the same medal and have achieved the same thing as he has"
    ],
    [
      "20240101_175009.jpg",
      "The images are funny since the .png image of the hat is supposed to have a transparent background but when the image is used for editing a mans picture it is seen that the background is not actually transparent and it ends up covering the face of the man in the other picture."
    ]
  ],
  "20240101_175155.jpg": [
    [
      "20240101_180515.jpg",
      "The image is ironic, because  in the first image the waiter is bringing the dish to the table presenting it as some lavish dish but in the second image when the dish is shown in the plate its just a small piece to eat"
    ],
    [
      "20240101_173355.jpg",
      "The images are funny since they show how smartphone manufacturers advertise their smartphones to have a high internal storage space but in reality, the amount of space available to an user is considerably less due to pre-installed software"
    ]
  ],
  "20240101_180345.jpg": [
    [
      "20240101_173654.jpg",
      "The image is ironic, as the text on the pack reads 'invisible tape', but the tape inside it is actually visible."
    ],
    [
      "20240101_175859.jpg",
      "The image is ironical, as people seem to be holding lighters to light up a woman's cigarette at an attempt to probably  impress her, while showing that the very same people are holding their noses on account of what appears to be bad smell coming out of the woman's mouth."
    ]
  ],
  "20240101_173227.jpg": [
    [
      "20240101_180751.jpg",
      "The image is ironical, as salad in a bowl by itself is very healthy. However, when people have it with Mayonnaise sauce to improve the taste, it is not healthy anymore, and defeats the point of having nutrient-rich salad altogether."
    ],
    [
      "20240101_180332.jpg",
      "The image is ironical, as a bathtub near a window having a very scenic view, becomes misty when someone is bathing, thus making the scenic view blurry."
    ]
  ],
  "20240101_173317.jpg": [
    [
      "20240101_173813.jpg",
      "The image is ironical, as even though the ergonomic chair is meant to facilitate an upright and comfortable posture for the person sitting on it, the person sitting on it still has a bent posture, as the person is not utilizing the backrest."
    ],
    [
      "20240101_174213.jpg",
      "The image is ironic, because in the left image a car is painted in camouflage color but in the right image the same car is getting involved in accident to due to its color as other drivers face difficulty in recognizing the colors"
    ]
  ],
  "20240101_173039.jpg": [
    [
      "20240101_172944.jpg",
      "The image is ironic, because the poster of sale at a store is posted 3 days ago on a social media account which means the sale which was for only one day has become over"
    ],
    [
      "20240101_180958.jpg",
      "The images are funny since even it shows how even though modern cars are fitted with features like reverse camera, drivers still choose to not use it and reverse the old fashioned way by looking behind"
    ]
  ],
  "20240101_172951.jpg": [
    [
      "20240101_182328.jpg",
      "The image is ironic, because people nowadays use eco-bag thinking them as safe for the environment but in turn use products which are harmful for the environment or are packaged in some non-biodegradable material"
    ],
    [
      "20240101_180754.jpg",
      "The images are ironic since even though e-tickets are provided to save resources like paper, people choose to print out e-tickets on large sheets of paper which leads to more wastage"
    ]
  ],
  "20240101_173308.jpg": [
    [
      "20240101_172420.jpg",
      "The image is ironic, because it shows over modernization, earlier the size was printed on the label attached to the clothes but now for knowing even the basic details about the cloth like size there is some barcode or QR code attached which need to be scanned by some mobile phone or electronic device"
    ],
    [
      "20240101_182519.jpg",
      "The images are funny since even though someone like \"Bob\" shows support for free speech as a civil right, he is not ready to deal with the consequences of free speech and chooses to not be spoken to by certain people. He thus blocks people from contacting him on his phone."
    ]
  ],
  "20240101_173700.jpg": [
    [
      "20240101_174123.jpg",
      "The image is ironical beaucse while the boy does not enjoy studying mathematics and different geometric shapes like semi circle and trapezoid and graphs of trigonometric equations like that of a sine wave, he enjoys skateboarding on surfaces and bowls that are built based on the said geometric shapes and graphs of trigonometric equations."
    ],
    [
      "20240101_182541.jpg",
      "The images are funny since it shows that even though the polished and colorful long nails look pretty and fashionable, the hinder the masseuse's ability to do her job of providing relaxing massages and hurts her customers"
    ]
  ],
  "20240101_173605.jpg": [
    [
      "20240101_175554.jpg",
      "The image is funny, because even when there is a dedicated thing for the animal to play with it still is hiding itself in the paper bag"
    ],
    [
      "20240101_180345.jpg",
      "The image is ironic, because the person has to travel 2 hours just to ride his bicycle for 17 minutes"
    ]
  ],
  "20240101_172955.jpg": [
    [
      "20240101_172412.jpg",
      "The images are ironic, since they show how men protest against abortion of babies but they choose to leave instead of taking care of the babies once they are born leaving the mother with neither a choice or support for raising a child"
    ],
    [
      "20240101_181054.jpg",
      "The image is funny because while the man does not like the boy playing music loudly on his phone, the man himself is okay with doing the same thing with his car and playing loud music in the car with the sound coming out of the car."
    ]
  ],
  "Screenshot_2024-01-01-17-59-17-340_com.twitter.android-edit.jpg": [
    [
      "20240101_174107.jpg",
      "The image is ironic, because the person who cries over the scratches on his car but applies stickers on his car happily which is quite dual nature of the person"
    ],
    [
      "20240101_180706.jpg",
      "The image is funny because the Hotel's name suggests that it is very good and as it's name itself is Hotel 5 stars but in reality it received a rating of only 3.7 out of 5"
    ]
  ],
  "20240101_175237.jpg": [
    [
      "20240101_180952.jpg",
      "The image is funny because while the umbrella helps a person avoid getting wet from rain, when the rain stops and the umbrella is folded, the wet umbrella iteself drips water on the person holding it."
    ],
    [
      "20240101_180932.jpg",
      "The image is ironical, as to clear the phone's memory using phone cleaner app, one has to install it, but that is not possible in turn due to the phone memory being full."
    ]
  ],
  "20240101_180912.jpg": [
    [
      "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg",
      "The images are funny since even though a woman goes for a full body massage expecting it to soothe her whole body, the design of a massage table is such that no matter how badly her nose itches, she cannot scratch it to soothe herself"
    ],
    [
      "20240101_173214.jpg",
      "The image is funny and showing a common problem with microsoft paint like applications where even a slight openings in the shapes causes entire drawing to be filled with the same color when using the fill color option. In this case, the person using the application intended to color only the ceiling of the house to brick red but ended up coloring the whole drawing with the brick red color."
    ]
  ],
  "20240101_182448.jpg": [
    [
      "20240101_173729.jpg",
      "The image is ironic, because in the left image she is seen how sincere she is about keeping her home clean but in the right image she forgets these principles while travelling in the car"
    ],
    [
      "20240101_173642.jpg",
      "The images are funny since they show how pet owners cannot enjoy any tasty food like pizza without sharing with their pets. The look from the pets makes the owner too guilty if he does not share his food"
    ]
  ],
  "20240101_180952.jpg": [
    [
      "20240101_173024.jpg",
      "The image is funny because while from the distance it seems that the man has big tattoos on both of his arms upon a closer look at the arms it turns out there is no tattoo and what seemed to be tattoos are just hairs on his arm."
    ],
    [
      "20240101_175614.jpg",
      "This is funny because on the one hand this person is rebelling against cops (slogan being All Cops Are Bad - ACAB), but on the other hand they are also calling the cops for help."
    ]
  ],
  "20240101_174029.jpg": [
    [
      "20240101_173239.jpg",
      "The image is ironic, because the woman is wearing a short dress to look stylish but she had to face inconvenience while travelling in car due to her short dress only."
    ],
    [
      "20240101_174629.jpg",
      "The images are funny since they show how close the user is to hitting his daily target of 10000 steps, but as soon as it is midnight, the step counter resets and the user misses his daily target by one step. Once the clock resets he is 9999 steps away from his target"
    ]
  ],
  "20240101_182333.jpg": [
    [
      "20240101_173813.jpg",
      "The image is ironical, as even though the ergonomic chair is meant to facilitate an upright and comfortable posture for the person sitting on it, the person sitting on it still has a bent posture, as the person is not utilizing the backrest."
    ],
    [
      "20240101_182629.jpg",
      "The image is ironical, as a product/service is rated 5 out of 5 stars, but it has only 1 review, and hence, this rating might actually be misleading."
    ]
  ],
  "20240101_181404.jpg": [
    [
      "20240101_173525.jpg",
      "the irony in this image is a small thing like a medicine very often has instructions and a manual that is extremely long"
    ],
    [
      "20240101_175627.jpg",
      "The image is funny, as the person is trying to operate the tap, but water comes out of the handheld shower resting on a holder instead of the tap, making the person drenched in water."
    ]
  ],
  "20240101_181006.jpg": [
    [
      "20240101_180636.jpg",
      "The image is ironic, because as the singer is performing in an orchestra but because there is so much crowd people at the back are not able to get a clear view of the singer"
    ],
    [
      "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg",
      "The images are funny since even though a woman goes for a full body massage expecting it to soothe her whole body, the design of a massage table is such that no matter how badly her nose itches, she cannot scratch it to soothe herself"
    ]
  ],
  "20240101_173642.jpg": [
    [
      "20240101_180455.jpg",
      "The image is ironical, as a man tips the waiter at a restaurant for the meal, but seems to not even acknowledge when his wife has made the meal for him at home."
    ],
    [
      "20240101_182519.jpg",
      "The images are funny since even though someone like \"Bob\" shows support for free speech as a civil right, he is not ready to deal with the consequences of free speech and chooses to not be spoken to by certain people. He thus blocks people from contacting him on his phone."
    ]
  ],
  "20240101_180832.jpg": [
    [
      "20240101_173214.jpg",
      "The image is funny and showing a common problem with microsoft paint like applications where even a slight openings in the shapes causes entire drawing to be filled with the same color when using the fill color option. In this case, the person using the application intended to color only the ceiling of the house to brick red but ended up coloring the whole drawing with the brick red color."
    ],
    [
      "20240101_172350.jpg",
      "The images are funny since it shows how the food packaging sets unreal expectations for the food inside with its graphics. The user gets to see the rather dull food once he opens the package and it is amusing to see how different the actual product is from the images"
    ]
  ],
  "20240101_180706.jpg": [
    [
      "20240101_175002.jpg",
      "The image is ironic, because even after nail clippers are available people prefer biting their nails by teeth"
    ],
    [
      "20240101_173000.jpg",
      "The image is satirical because the intention of wearing a glove while preparing food is to not let any germs and dirt from our hands get into the food, people do other tasks like collecting money from the customer wearing the same gloves and thus making the gloves themselves dirty."
    ]
  ],
  "20240101_182519.jpg": [
    [
      "20240101_180802.jpg",
      "The image is ironic, because in the left image the man is showing love and care for the puppy but in the right image the same puppy is shown to be chained in a kennel, which shows dual nature of human towards animals"
    ],
    [
      "20240101_180802.jpg",
      "The image is ironic, because in the left image the man is showing love and care for the puppy but in the right image the same puppy is shown to be chained in a kennel, which shows dual nature of human towards animals"
    ]
  ],
  "20240101_175023.jpg": [
    [
      "20240101_174949.jpg",
      "the irony is that dog owners buy loads of toys for their dog but the dog's favourite toy is the owner's slippers"
    ],
    [
      "20240101_182357.jpg",
      "The images are funny since it shows a man with tattoos on his exposed body parts in normal clothing gives the illusion that he has tattoos all over his body, but in reality, he has tattoos only on those few parts."
    ]
  ],
  "20240101_174518.jpg": [
    [
      "20240101_173752.jpg",
      "The image is funny, as there are two electrical sockets side-by-side, but the adapter is shaped in such a way, that if two adapters are inserted into the two sockets, they will butt into each other, leading to inconvenience."
    ],
    [
      "20240101_175759.jpg",
      "The image is ironic, because in the first image it shows that someone plan their life in a to-do list but as the future is unknown anyone can never be sure whether he/she can complete their to-do lists"
    ]
  ],
  "20240101_181439.jpg": [
    [
      "20240101_173108.jpg",
      "The image is ironic, because the mountaineer climbs up the mountain to view the world from the peak but due to so much cloud, at the top, nothing is visible whereas he was able to witness some awesome views while climbing up the mountain"
    ],
    [
      "20240101_180958.jpg",
      "The images are funny since even it shows how even though modern cars are fitted with features like reverse camera, drivers still choose to not use it and reverse the old fashioned way by looking behind"
    ]
  ],
  "20240101_182625.jpg": [
    [
      "20240101_174540.jpg",
      "The image is ironic because even though a boxer has won the match and it is supposed to be a moment of celebration, the boxer got bruised in several places during the match. This is an illustration of what hurdles a person has to go through in order to succeed."
    ],
    [
      "20240101_182448.jpg",
      "The image is funny because even though the trolley bag is made to make carrying luggage easy, as soon as it encounters a rough surface like cobblestone road, it makes carrying luggage more difficult."
    ]
  ],
  "20240101_180026.jpg": [
    [
      "20240101_180155.jpg",
      "The image is ironic, because an old man with good looking clothes, symbolising him as rich, is showing a quote on the difficulty for a rich man to gain eternal life whereas the man has both long life meaning eternal life and good clothes meaning rich"
    ],
    [
      "20240101_182552.jpg",
      "The image is funny because while the food for the dog that the woman pours is well balanced, the food that she herself is eating is bad for her health."
    ]
  ],
  "20240101_175413.jpg": [
    [
      "20240101_182249.jpg",
      "The image is ironic, because it conveys the message that even with the costliest of pens people handwriting remains the same"
    ],
    [
      "20240101_173638.jpg",
      "The image is funny because a well-built person wearing an aggressive tank-top with the word \"KILL\" on an image of a skull is having very childish flavours of whey protein such as teddy vanilla, yummy yummy choco, and strawberry vanilla, contrary to the person's external persona. This depicts the metaphor 'Do not judge a book by its cover'."
    ]
  ],
  "20240101_173419.jpg": [
    [
      "20240101_174225.jpg",
      "The image is ironic because in the first image it is shown that the woman has got salad for her but she is having french fries from the man's plate which displays that the girl is trying to show herself as health conscious by having a plate of salad for her but she wants to have to have fast food but rather than having them for herself she is taking some from other's plate"
    ],
    [
      "20240101_182638.jpg",
      "The image is ironic, because in the left image as in the logo it shows happy chicken but in the right image the chicken pieces are shown packed in boxes"
    ]
  ],
  "20240101_180618.jpg": [
    [
      "20240101_172400.jpg",
      "This image is funny because images of very regular things - a stick figure and a bicycle, get converted into  looking phallic from a distance."
    ],
    [
      "20240101_172317.jpg",
      "The image is funny, as the person has made tattoos at places that are visible when wearing clothes, but look very awkward otherwise."
    ]
  ],
  "20240101_172924.jpg": [
    [
      "20240101_175836.jpg",
      "The image is ironic, because on the left image the person is sending their resume to someone and on the right they are rejecting the unknown calls which might be some offer calls  or the person who sent the resume maybe tired of the spam calls after sending the resume which he sent seeking some new oppurtunities"
    ],
    [
      "20240101_173718.jpg",
      "The image just speaks yes, but in a different way as \"yes, butt\" like in the early morning the man had to look at the cat's butt because it is standing over the man's body"
    ]
  ],
  "20240101_173003.jpg": [
    [
      "20240101_173100.jpg",
      "This image is funny because its an assumed expectation that  the dead phone will be rescued by the power bank, but here the power bank is also dead and of no use."
    ],
    [
      "20240101_174958.jpg",
      "the irony is that people lock their bikes on poles where anyone can just lift the bike out of the pole"
    ]
  ],
  "20240101_173752.jpg": [
    [
      "20240101_175445.jpg",
      "The image is ironical, as a team and its are all celebrating on the ground after winning the match, but after the match, the fans are standing in the bus uncomfortably, while the players are travelling inside a carring the cup as well as the prize money, which the fans did not get a dime of."
    ],
    [
      "20240101_174903.jpg",
      "The image is ironic, because people nowadays at home want to feel the nature but when the same person gets some moments to enjoy the nature they just ignore the surroundings"
    ]
  ],
  "20240101_180807.jpg": [
    [
      "20240101_175031.jpg",
      "The image is satirical because the man that is shooting money in the air causing a rain of money bills is the same person who is crouching down to collect the fallen dollar bills from the ground which makes the act of shooting bills in the air not so fun."
    ],
    [
      "20240101_173355.jpg",
      "The images are funny since they show how smartphone manufacturers advertise their smartphones to have a high internal storage space but in reality, the amount of space available to an user is considerably less due to pre-installed software"
    ]
  ],
  "20240101_172913.jpg": [
    [
      "20240101_172400.jpg",
      "This image is funny because images of very regular things - a stick figure and a bicycle, get converted into  looking phallic from a distance."
    ],
    [
      "20240101_173525.jpg",
      "the irony in this image is a small thing like a medicine very often has instructions and a manual that is extremely long"
    ]
  ],
  "20240101_181457.jpg": [
    [
      "20240101_180751.jpg",
      "The image is ironical, as salad in a bowl by itself is very healthy. However, when people have it with Mayonnaise sauce to improve the taste, it is not healthy anymore, and defeats the point of having nutrient-rich salad altogether."
    ],
    [
      "20240101_173100.jpg",
      "This image is funny because its an assumed expectation that  the dead phone will be rescued by the power bank, but here the power bank is also dead and of no use."
    ]
  ],
  "20240101_173729.jpg": [
    [
      "20240101_172407.jpg",
      "The image is ironic, because in the first image it seems that the woman is praying whole heartedly by bowing down in front of the statue but in the second image the same image is seen posted on the internet, so the woman was just posing for a photo to be posted on internet to gain followers or likes"
    ],
    [
      "20240101_175541.jpg",
      "The image is ironical, as the cans of paint used to make graffiti on the theme \"Save the Earth\" seems to be destroying the Earth when it overflows on the grass, as it is harmful for the flora and fauna, as can be seen from the dying insects."
    ]
  ],
  "20240101_181343.jpg": [
    [
      "20240101_172420.jpg",
      "The image is ironic, because it shows over modernization, earlier the size was printed on the label attached to the clothes but now for knowing even the basic details about the cloth like size there is some barcode or QR code attached which need to be scanned by some mobile phone or electronic device"
    ],
    [
      "20240101_174927.jpg",
      "The image is ironical, as a woman is sitting by the sink taking a selfie using a mirror, while not using a chair that is actually meant for sitting."
    ]
  ],
  "20240101_180626.jpg": [
    [
      "20240101_173552.jpg",
      "The images are funny since it shows how someone has put effort into a cup of coffee to do latte art on it only for it to be invisible after a lid is put on the coffee cup before serving to a customer"
    ],
    [
      "20240101_182451.jpg",
      "The image is funny because while the woman claims she to be young, the likely year of her birth 1992 which can be inferred from her handle \"jessica92\" suggests that she is very old."
    ]
  ],
  "20240103_213052.jpg": [
    [
      "20240101_181411.jpg",
      "The image is funny, as one person with a hair dyed blue seems to symbolize that the person is going against the grain, however, when we zoom out, the group of people have hair dyed in several, different colors, showing that, dyeing hair is the new normal."
    ],
    [
      "20240101_182448.jpg",
      "The image is funny because even though the trolley bag is made to make carrying luggage easy, as soon as it encounters a rough surface like cobblestone road, it makes carrying luggage more difficult."
    ]
  ],
  "20240101_172400.jpg": [
    [
      "20240101_175445.jpg",
      "The image is ironical, as a team and its are all celebrating on the ground after winning the match, but after the match, the fans are standing in the bus uncomfortably, while the players are travelling inside a carring the cup as well as the prize money, which the fans did not get a dime of."
    ],
    [
      "20240101_180312.jpg",
      "The image creates a comparison between the following and followers of a account which suggests that the person/organizations follows more people/organizations than being followed back"
    ]
  ],
  "20240101_180335.jpg": [
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ],
    [
      "20240101_174000.jpg",
      "Although the person has purchased a king size bed, but only less than half of the space is used by the person for sleeping."
    ]
  ],
  "20240101_180155.jpg": [
    [
      "20240101_172944.jpg",
      "The image is ironic, because the poster of sale at a store is posted 3 days ago on a social media account which means the sale which was for only one day has become over"
    ],
    [
      "20240101_180247.jpg",
      "the irony in this image is that people ignore all the chaos around them and get distracted by a cat."
    ]
  ],
  "20240101_180754.jpg": [
    [
      "20240101_181319.jpg",
      "The image is ironic, because people often use rowing machine at the gym don't prefer rowing when it comes to boats"
    ],
    [
      "20240101_174757.jpg",
      "The images are funny since it shows a woman simply sipping from a cup at ease in a cafe with her laptop not caring about anything going on outside the cafe even though the situation is very grave,that is, a nuclear blast"
    ]
  ],
  "20240101_172838.jpg": [
    [
      "20240101_182235.jpg",
      "The image is ironic, because in the first image the tattoo of a snake on someone's hand may give us a hint about how powerful or brave the person can be who is having this tattoo but in the second image the person with same tattoo is seen frightened due to a snake in his house"
    ],
    [
      "20240101_175353.jpg",
      "The same sea which gives us a relaxation on a normal day can pose a danger to us sometimes like during a tsunami"
    ]
  ],
  "20240101_180032.jpg": [
    [
      "20240101_173232.jpg",
      "The action scenes of the movies or TV programs are mostly low in sound and people aren't able to hear them properly but in the action scenes due to the background music and other noise the sound becomes unbearable to some peoples"
    ],
    [
      "20240101_175738.jpg",
      "The image is ironic, because a person is seen feeling proud over the profit earned over his investment but the right image shows the whole story how only a small part of his investment journey is shown and the other loss part is ignored"
    ]
  ],
  "20240101_173024.jpg": [
    [
      "20240101_175031.jpg",
      "The image is satirical because the man that is shooting money in the air causing a rain of money bills is the same person who is crouching down to collect the fallen dollar bills from the ground which makes the act of shooting bills in the air not so fun."
    ],
    [
      "20240101_180844.jpg",
      "The image is ironic, because the left door of the car is easily opened with still space left so the car could have been parked more on the left whereas the right door of the car is getting stuck due to the less space between the two cars and the person in facing difficulty in getting himself out but person on the left easily gets out"
    ]
  ],
  "20240101_180927.jpg": [
    [
      "20240101_181146.jpg",
      "This image is funny because a cap is MEANT to protect one's eyes from the sun, but this person is more interested in using it to look stylish, even if it makes them uncomfortable."
    ],
    [
      "20240101_181128.jpg",
      "The image is funny because the player thinks that when he scores a goal he will thank the god and show his t-shirt saying \"GOD IS GREAT\" but he ends up not being able to score any goals meaning that God did not want him to score any goals."
    ]
  ],
  "20240101_182328.jpg": [
    [
      "20240101_172315.jpg",
      "The images are funny since they show how the prettiest footwears like high heels, end up causing a lot of physical discomfort to the user, all in the name fashion"
    ],
    [
      "20240101_173029.jpg",
      "The irony in this image describes shrinkflation, which is when stores start selling big bags of products with less product in them."
    ]
  ],
  "20240101_182426.jpg": [
    [
      "20240101_174123.jpg",
      "The image is ironical beaucse while the boy does not enjoy studying mathematics and different geometric shapes like semi circle and trapezoid and graphs of trigonometric equations like that of a sine wave, he enjoys skateboarding on surfaces and bowls that are built based on the said geometric shapes and graphs of trigonometric equations."
    ],
    [
      "20240101_181439.jpg",
      "The image is ironical, as having breakfast in bed is a luxury. However, eating while in bed leads to food crumbs, making the bed dirty, along with the need to clean the bed afterwards."
    ]
  ],
  "20240101_181054.jpg": [
    [
      "Screenshot_2024-01-01-17-38-54-117_com.twitter.android-edit.jpg",
      "The images are ironic since it shows how women are represented in our society. When it comes to a men's boxing match, a woman in revealing clothes is expected to hold out boards depicting round numbers but in a women's boxing match, they do not expect men to do so. It is poking fun at the gender roles that exist in our society"
    ],
    [
      "20240101_180403.jpg",
      "The images are funny since they show how a workspace has installed drinking water dispenser but it is of no use since the water cup dispenser is left empty"
    ]
  ],
  "20240101_175759.jpg": [
    [
      "20240101_173756.jpg",
      "The people who claim to predict the future either find their predictions unsuccessful or avoid themselves from making claims related to finance, lotteries, and bets."
    ],
    [
      "20240101_172947.jpg",
      "The image is ironic because although the clothes are of branded companies but they are hanging in very poor building."
    ]
  ],
  "20240101_173108.jpg": [
    [
      "20240101_180643.jpg",
      "The image is ironic, because there are many different color currency notes' bundles but they are just as a currency in the game of monopoly and they have no real value"
    ],
    [
      "20240101_182629.jpg",
      "The image is ironical, as a product/service is rated 5 out of 5 stars, but it has only 1 review, and hence, this rating might actually be misleading."
    ]
  ],
  "20240101_175002.jpg": [
    [
      "20240101_175413.jpg",
      "This is funny because the pie chart printout is useless as you cant see any divisions on it because the  printer could not capture the different colors"
    ],
    [
      "20240101_175155.jpg",
      "The images are funny since they show how even though the hired movers achieve their task of moving in furniture, in the process, the cause damage to the whole house"
    ]
  ],
  "20240101_175541.jpg": [
    [
      "20240101_172317.jpg",
      "The image is funny, as the person has made tattoos at places that are visible when wearing clothes, but look very awkward otherwise."
    ],
    [
      "20240101_182235.jpg",
      "The image is ironic, because in the first image the tattoo of a snake on someone's hand may give us a hint about how powerful or brave the person can be who is having this tattoo but in the second image the person with same tattoo is seen frightened due to a snake in his house"
    ]
  ],
  "20240101_173532.jpg": [
    [
      "20240101_174842.jpg",
      "These images are funny since it shows how we are taught emergency procedures to follow in case of an accident while in an airplane but how none of them work if the plane is still in air"
    ],
    [
      "20240101_181054.jpg",
      "The image is funny because while the man does not like the boy playing music loudly on his phone, the man himself is okay with doing the same thing with his car and playing loud music in the car with the sound coming out of the car."
    ]
  ],
  "20240101_173647.jpg": [
    [
      "20240101_181415.jpg",
      "The image is funny because the full plate of cookies is hiding the entire nutrition facts leading readers to believe that the entire box of cookies amounts to just 160 calories but when all the cookies are eaten and the plate is empty, the rest of the nutrition table is visible which tells that each serving of cookies amounts to 160 calories where one serving consists of 3 cookies."
    ],
    [
      "20240101_172936.jpg",
      "This image is funny, as a car is approaching a Y junction, with the left fork empty, and the right fork filled with a line of cars. If it needs to go to the right, it should get behind the line of cars. However, in an attempt to probably go faster, the car tries to cut in line, leading to more traffic,  thereby increasing commute time."
    ]
  ],
  "20240101_181146.jpg": [
    [
      "20240101_182519.jpg",
      "The images are funny since even though someone like \"Bob\" shows support for free speech as a civil right, he is not ready to deal with the consequences of free speech and chooses to not be spoken to by certain people. He thus blocks people from contacting him on his phone."
    ],
    [
      "20240101_172838.jpg",
      "The image is ironic, as the t-shirt that says \"NONBINARY\" has only 2 options for gender on an online retail forum."
    ]
  ],
  "20240101_174055.jpg": [
    [
      "20240101_180545.jpg",
      "The image is funny because while the man claims to be vegan, he is biting skin off his own hand."
    ],
    [
      "20240101_175107.jpg",
      "The image is funny, as the bathroom sink looks clean, but when you zoom into the touch power button, you can see fingerprint smudges."
    ]
  ],
  "20240101_180658.jpg": [
    [
      "20240101_173921.jpg",
      "The image is funny, as the weather is sunny during the weekdays, which are generally the days when people work in a job. People look forward to go outside and enjoy in the weekend, but due to an unexpected rainy weather, people will not be able to go outside."
    ],
    [
      "20240101_180455.jpg",
      "The image is ironical, as a man tips the waiter at a restaurant for the meal, but seems to not even acknowledge when his wife has made the meal for him at home."
    ]
  ],
  "20240101_182249.jpg": [
    [
      "20240101_173752.jpg",
      "The image is funny, as there are two electrical sockets side-by-side, but the adapter is shaped in such a way, that if two adapters are inserted into the two sockets, they will butt into each other, leading to inconvenience."
    ],
    [
      "20240101_180340.jpg",
      "The image is ironical, as an inanimate box of building blocks has been secured by the seatbelt in the backseat of a car, while a person sitting in the backseat is not wearing the seatbelt, while the person would actually need the seatbelt in case there is an accident."
    ]
  ],
  "20240101_175259.jpg": [
    [
      "20240101_180952.jpg",
      "The image is funny because while the umbrella helps a person avoid getting wet from rain, when the rain stops and the umbrella is folded, the wet umbrella iteself drips water on the person holding it."
    ],
    [
      "20240101_172417.jpg",
      "The image is ironical, as a person sets a strong password for Wifi, while setting a very simple 4-digit PIN (1234 here) for online banking, where a much higher level of security would be required instead."
    ]
  ],
  "20240101_175009.jpg": [
    [
      "20240101_180026.jpg",
      "The images are ironic since a dog shampoo bottle has a sticker indicating that it has not been tested on animals and hence might not be safe for animal use. It is amusing that a product designed to be used by animals is not tested on animals for their safety"
    ],
    [
      "20240101_175647.jpg",
      "The image is ironical, as even though the art studio contains a palette of a range of color paints, the painting on the canvas is black and white."
    ]
  ],
  "20240101_181310.jpg": [
    [
      "20240101_174540.jpg",
      "The image is ironic because even though a boxer has won the match and it is supposed to be a moment of celebration, the boxer got bruised in several places during the match. This is an illustration of what hurdles a person has to go through in order to succeed."
    ],
    [
      "20240101_182506.jpg",
      "The image is funny, as when looking from the front, girl's pants are spick and span, while looking from the back, her pants are soaked in water, probably due to walking on a road filled with water in high heels. This is ironical, as the very reason for wearing heels (i.e. looking beautiful) is defeated, due to the heels themselves."
    ]
  ],
  "20240101_181101.jpg": [
    [
      "20240101_172420.jpg",
      "The image is ironic, because it shows over modernization, earlier the size was printed on the label attached to the clothes but now for knowing even the basic details about the cloth like size there is some barcode or QR code attached which need to be scanned by some mobile phone or electronic device"
    ],
    [
      "20240101_173232.jpg",
      "The action scenes of the movies or TV programs are mostly low in sound and people aren't able to hear them properly but in the action scenes due to the background music and other noise the sound becomes unbearable to some peoples"
    ]
  ],
  "20240101_174225.jpg": [
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ],
    [
      "20240101_180312.jpg",
      "The image creates a comparison between the following and followers of a account which suggests that the person/organizations follows more people/organizations than being followed back"
    ]
  ],
  "20240101_182238.jpg": [
    [
      "20240101_172955.jpg",
      "The image is funny, as the drink seems to be full to begin with, while most of the volume of the drink is occupied by the ice cubes."
    ],
    [
      "20240101_173007.jpg",
      "The image is ironical, as the umbrella is meant to provide shadow in the area where the chairs are present, but due to the orientation of the rays of the sun, all the chairs are in sunlight, and the umbrella is of no use in this situation."
    ]
  ],
  "20240101_172731.jpg": [
    [
      "20240101_182503.jpg",
      "The image is ironic, because some people like to enjoy watching the biodiversity under water but they are not able to explore this due to excess crowd in such places where people like to play, swim etc. in water"
    ],
    [
      "20240101_172351.jpg",
      "The image is satirical because while the man overfils his plate with differnt food items, he ends up wasting almost all of it by not eating them or by taking just one bite out of them leaving the rest."
    ]
  ],
  "20240101_173826.jpg": [
    [
      "20240101_173605.jpg",
      "This image is ironical, as a person holding up a \"Free Hugs\" sign is standing alone, while an inanimate Wi-fi Router giving \"Free Wifi\" is surrounded people trying to connect to it. This shows a growing lack of empathy in our society, while showing our increasing dependence on the digital devices in a virtual world."
    ],
    [
      "Screenshot_2024-01-01-18-12-18-789_com.twitter.android-edit.jpg",
      "the irony in this image is that people say that they like to read things while they instantly skip reading the terms and conditions when registering for anything online."
    ]
  ],
  "20240101_181128.jpg": [
    [
      "20240101_181457.jpg",
      "The image is of a metro or railway station which shows that the person in left is standing in the middle at the correct place to board the train, but in the right, the doors of the train are wronglyÃ\u0082Â positioned"
    ],
    [
      "20240101_174719.jpg",
      "The image is ironic, because even when the pigeon has wings to fly it is walking even when it seems threatening to its life"
    ]
  ],
  "20240101_182638.jpg": [
    [
      "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg",
      "The images are funny since even though a woman goes for a full body massage expecting it to soothe her whole body, the design of a massage table is such that no matter how badly her nose itches, she cannot scratch it to soothe herself"
    ],
    [
      "20240101_173927.jpg",
      "The image is ironical, as an apparently rich person walks inside the airport with luggage, but has to sleep on the floor  due to the flight being delayed and an absence of vacant seats in the airport."
    ]
  ],
  "20240101_182357.jpg": [
    [
      "20240101_180312.jpg",
      "The image creates a comparison between the following and followers of a account which suggests that the person/organizations follows more people/organizations than being followed back"
    ],
    [
      "20240101_175208.jpg",
      "The image is ironic, because in one image the softy cone is shown filled with softy but in second image it is visible that only the top of the cone is filled and at the inside the cone is vacant"
    ]
  ],
  "20240101_173141.jpg": [
    [
      "20240101_172731.jpg",
      "Image is funny because the box of salad was marketed in a way that showed a lot more salad content than was really present inside it."
    ],
    [
      "20240101_182357.jpg",
      "The images are funny since it shows a man with tattoos on his exposed body parts in normal clothing gives the illusion that he has tattoos all over his body, but in reality, he has tattoos only on those few parts."
    ]
  ],
  "20240101_182308.jpg": [
    [
      "20240101_173712.jpg",
      "The image is ironic, because the left image suggest that a person applies lipsticks on their lips to make their lips look attractive or to keep them hydrated but on the contrary it gets sticked to the glasses or mugs and gets wasted"
    ],
    [
      "20240101_182629.jpg",
      "The image is ironical, as a product/service is rated 5 out of 5 stars, but it has only 1 review, and hence, this rating might actually be misleading."
    ]
  ],
  "20240101_180947.jpg": [
    [
      "20240101_172412.jpg",
      "The images are ironic, since they show how men protest against abortion of babies but they choose to leave instead of taking care of the babies once they are born leaving the mother with neither a choice or support for raising a child"
    ],
    [
      "20240101_181319.jpg",
      "The image is ironic, because people often use rowing machine at the gym don't prefer rowing when it comes to boats"
    ]
  ],
  "20240101_180851.jpg": [
    [
      "20240101_172944.jpg",
      "The image is ironic, because the poster of sale at a store is posted 3 days ago on a social media account which means the sale which was for only one day has become over"
    ],
    [
      "20240101_173624.jpg",
      "The images are ironic since they show how even though electric powered cars are touted to be a game changer in the automotive industry and claims are made that they will make the world a greener and cleaner place to live in, the reality is quite different. Battery production causes vast amounts of pollution making such claims very doubtful"
    ]
  ],
  "20240101_174708.jpg": [
    [
      "20240101_173748.jpg",
      "The images are funny since they show how women plan out holidays with much care but their menstrual cycles ruin their plans by causing trouble due to bleeding and discomfort that occur during menstruation"
    ],
    [
      "20240101_182246.jpg",
      "The image is funny, as when making a strawberry cake using  a recipe book, the outcome is not quite what is expected, and one has to wash the used utensils afterwards as well."
    ]
  ],
  "20240101_175602.jpg": [
    [
      "20240101_173706.jpg",
      "The image is ironic, because even after when the skateboard scooters are available for someone to ride but the road has many potholes that it is not suitable to ride the scooters on such roads"
    ],
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ]
  ],
  "20240101_175031.jpg": [
    [
      "20240101_173007.jpg",
      "The image is ironical, as the umbrella is meant to provide shadow in the area where the chairs are present, but due to the orientation of the rays of the sun, all the chairs are in sunlight, and the umbrella is of no use in this situation."
    ],
    [
      "20240101_180758.jpg",
      "The image is ironic, because in the first image a toy, purposed for the cat to play with is shown but in the second image the cat is comfortably enjoying  to play on the sides of sofa"
    ]
  ],
  "20240101_172351.jpg": [
    [
      "20240101_174518.jpg",
      "The image is ironic, because the people who get sentimental over imprisoned animal while watching TV shows often feel okay when using animals for labor"
    ],
    [
      "20240101_181319.jpg",
      "The image is ironic, because people often use rowing machine at the gym don't prefer rowing when it comes to boats"
    ]
  ],
  "20240101_172348.jpg": [
    [
      "20240101_173326.jpg",
      "The images are funny since it shows how people tend to forget the important details like names of presidents but remember the useless ones, like forgetting names of presidents but remembering the names of their exes in this example"
    ],
    [
      "Screenshot_2024-01-01-17-38-54-117_com.twitter.android-edit.jpg",
      "The images are ironic since it shows how women are represented in our society. When it comes to a men's boxing match, a woman in revealing clothes is expected to hold out boards depicting round numbers but in a women's boxing match, they do not expect men to do so. It is poking fun at the gender roles that exist in our society"
    ]
  ],
  "20240101_174757.jpg": [
    [
      "20240101_180340.jpg",
      "The image is ironical, as an inanimate box of building blocks has been secured by the seatbelt in the backseat of a car, while a person sitting in the backseat is not wearing the seatbelt, while the person would actually need the seatbelt in case there is an accident."
    ],
    [
      "20240101_172834.jpg",
      "the irony in this image is that the seat right above a bus' wheels is the most uncomfortable one."
    ]
  ],
  "20240101_173010.jpg": [
    [
      "20240101_180037.jpg",
      "The image is ironic, because in the first image clear sky is visible but in the second image the same view is getting blocked due to the electricity pole"
    ],
    [
      "20240101_175608.jpg",
      "The image is ironical, as the team is celebrating as they think that they have scored a goal, but the sign on the screen says that it is an offside, and not a goal. This is a very common scenario in football matches."
    ]
  ],
  "20240101_173921.jpg": [
    [
      "20240101_174958.jpg",
      "the irony is that people lock their bikes on poles where anyone can just lift the bike out of the pole"
    ],
    [
      "20240101_174737.jpg",
      "The image is ironic, because in the first image the woman is seen as enjoying the view but in the second image the same woman is seen as looking at a pooping dog"
    ]
  ],
  "20240101_173552.jpg": [
    [
      "20240101_172928.jpg",
      "The images are funny since they show how a jumbled rubiks cube appears solved simply because of the viewers perspective."
    ],
    [
      "20240101_173712.jpg",
      "The image is ironic, because the left image suggest that a person applies lipsticks on their lips to make their lips look attractive or to keep them hydrated but on the contrary it gets sticked to the glasses or mugs and gets wasted"
    ]
  ],
  "20240101_172339.jpg": [
    [
      "20240101_180403.jpg",
      "The images are funny since they show how a workspace has installed drinking water dispenser but it is of no use since the water cup dispenser is left empty"
    ],
    [
      "20240101_173141.jpg",
      "The images are ironic since we work to improve technology and build innovations like robots, but in the process we ourselves become less human and robotic in the way we function."
    ]
  ],
  "20240101_180802.jpg": [
    [
      "20240101_181001.jpg",
      "The image is funny because why people like to get whole pies, they only end up eating a small portion of it wasting the rest of the pie."
    ],
    [
      "20240101_182519.jpg",
      "The images are funny since even though someone like \"Bob\" shows support for free speech as a civil right, he is not ready to deal with the consequences of free speech and chooses to not be spoken to by certain people. He thus blocks people from contacting him on his phone."
    ]
  ],
  "20240101_180037.jpg": [
    [
      "20240101_174654.jpg",
      "The images are funny since it shows how even a mighty king must do simple things like using a toilet just like everyone else does"
    ],
    [
      "20240101_173043.jpg",
      "The image is ironic, because on one hand the person is consuming diet cola suggesting low on sugar as per label meaning the person is health-conscious but on the other hand the same one is having huge size burger with french fries which suggests the person to be health-ignorant"
    ]
  ],
  "20240101_174119.jpg": [
    [
      "20240101_173605.jpg",
      "This image is ironical, as a person holding up a \"Free Hugs\" sign is standing alone, while an inanimate Wi-fi Router giving \"Free Wifi\" is surrounded people trying to connect to it. This shows a growing lack of empathy in our society, while showing our increasing dependence on the digital devices in a virtual world."
    ],
    [
      "20240101_173642 (1).jpg",
      "The image is ironic, because even when there are steel frame baskets are available at the supermarkets people prefer carrying the items in hand"
    ]
  ],
  "20240101_172412.jpg": [
    [
      "20240101_173936.jpg",
      "The image is funny because while the playlist is labelled \"music I love\" indicating that all the music in the playlist is very well liked by the user but the user is pressing play next button after listening to a few seconds of one of the audios in the playlist."
    ],
    [
      "20240101_172947.jpg",
      "The image is ironic because although the clothes are of branded companies but they are hanging in very poor building."
    ]
  ],
  "20240101_172936.jpg": [
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ],
    [
      "20240101_172843.jpg",
      "The image is ironic, because the person is seen as applying tape over laptop's camera over some privacy concerns but on the other hand he/she carries the phone without covering its camera"
    ]
  ],
  "20240101_182413.jpg": [
    [
      "20240101_173003.jpg",
      "The images are funny since they show how a peaceful sight like a woman painting a natural scenery looks good only from afar. When looked closely we can see details like flies on the painting which make us uneasy and the scene is not so good to look at anymore."
    ],
    [
      "20240101_175627.jpg",
      "The image is funny, as the person is trying to operate the tap, but water comes out of the handheld shower resting on a holder instead of the tap, making the person drenched in water."
    ]
  ],
  "20240101_182252.jpg": [
    [
      "20240101_180159.jpg",
      "This image is funny because an eatery that calls itself the \"healthy\" cafe also has a smoking area, which is not very \"healthy\". If it really was a healthy cafe, it would not have a smoking area as smoking is injurious to health. Satire on the behavior of humans - both those that operate this cafe who made the decision of allowing smoking and creating a designated smoking area, and those that visit this healthy cafe to become \"healthy\", but then also indulge in very unhealthy habits simultaneously."
    ],
    [
      "20240101_172315.jpg",
      "The images are funny since they show how the prettiest footwears like high heels, end up causing a lot of physical discomfort to the user, all in the name fashion"
    ]
  ],
  "20240101_174853.jpg": [
    [
      "20240101_172951.jpg",
      "The image is ironic, because the sole purpose of the person was to get a hair cut but he became so much engrossed in the game that the barber wasn't able to cut his hairs properly. and even the saloon is providing so many facilities but they don't have a good hairdresser"
    ],
    [
      "20240101_173003.jpg",
      "The images are funny since they show how a peaceful sight like a woman painting a natural scenery looks good only from afar. When looked closely we can see details like flies on the painting which make us uneasy and the scene is not so good to look at anymore."
    ]
  ],
  "20240101_175531.jpg": [
    [
      "20240101_173013.jpg",
      "The image is ironical, as the message \"Drink more water\" is meant to improve health, but in turn, it would lead to longer queues in front of public toilets, leading to people holding urine for longer periods, in turn leading to deterioration in health."
    ],
    [
      "20240101_175247.jpg",
      "The image is funny because the object which is said to be fragile by the tape turns out to be an equipment to practice punches and kicks on meaning that it is very tought and sturdy."
    ]
  ],
  "20240101_180643.jpg": [
    [
      "20240101_173308.jpg",
      "This image is ironic as on the one hand, the presumed person is into skincare and wants to do the best for their skin, which is good, but on the other hand, they are involved in unhealthy habits that will damage their skin like smoking, caffeine and inadequate sleep."
    ],
    [
      "20240101_180932.jpg",
      "The image is ironical, as to clear the phone's memory using phone cleaner app, one has to install it, but that is not possible in turn due to the phone memory being full."
    ]
  ],
  "20240101_182246.jpg": [
    [
      "20240101_182511.jpg",
      "The image is ironic, because in the second image it is shown that a group of people is attending someone's death ceremony but one of them is shown as wrongly dressed for that place in first image, his visual appearances doesn't shows his feeling of mourning"
    ],
    [
      "20240101_172336.jpg",
      "The image is funny because the person has a lot of furniture for his computer but none for himself."
    ]
  ],
  "20240101_173219.jpg": [
    [
      "20240101_172351.jpg",
      "The image is satirical because while the man overfils his plate with differnt food items, he ends up wasting almost all of it by not eating them or by taking just one bite out of them leaving the rest."
    ],
    [
      "20240101_174536.jpg",
      "The image is funny because a person opens a door with the sign 'OPEN', meaning the place is open. However, once the person enters the building and looks back, the other side of the sign reads 'CLOSE', which ideally should not be the case, as the place is actually open."
    ]
  ],
  "20240101_173054.jpg": [
    [
      "20240101_172417.jpg",
      "The image is ironical, as a person sets a strong password for Wifi, while setting a very simple 4-digit PIN (1234 here) for online banking, where a much higher level of security would be required instead."
    ],
    [
      "20240101_182541.jpg",
      "The images are funny since it shows that even though the polished and colorful long nails look pretty and fashionable, the hinder the masseuse's ability to do her job of providing relaxing massages and hurts her customers"
    ]
  ],
  "20240101_172325.jpg": [
    [
      "20240101_175820.jpg",
      "The image is ironical, as the relaxation kit is meant to relax and calm down the person using it during a bath, but the showering area is an enclosed space, which might instead tense up someone, especially if the person is claustrophobic."
    ],
    [
      "20240101_173317.jpg",
      "The images are funny since a man trying to reduce his irritation by killing a mosquito bothering  him only causes himself more irritation by soiling his t-shirt with the mosquito blood"
    ]
  ],
  "20240101_181009.jpg": [
    [
      "20240101_180607.jpg",
      "Women wear netted tops while out in the sun on the beach as a beachwear, but when the person removes it, the skin is tanned in the same netted pattern looks weird, and goes against the purpose of using it as beachwear"
    ],
    [
      "20240101_173700.jpg",
      "the irony in this image is that people waste pizza crust by saying that it is too hard, while they eat hard chocolate without any complaints"
    ]
  ],
  "20240101_175808.jpg": [
    [
      "20240101_174540.jpg",
      "The image is ironic because even though a boxer has won the match and it is supposed to be a moment of celebration, the boxer got bruised in several places during the match. This is an illustration of what hurdles a person has to go through in order to succeed."
    ],
    [
      "20240101_182246.jpg",
      "The image is funny, as when making a strawberry cake using  a recipe book, the outcome is not quite what is expected, and one has to wash the used utensils afterwards as well."
    ]
  ],
  "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg": [
    [
      "20240101_175208.jpg",
      "The image is ironic, because in one image the softy cone is shown filled with softy but in second image it is visible that only the top of the cone is filled and at the inside the cone is vacant"
    ],
    [
      "20240101_173813.jpg",
      "The image is ironical, as even though the ergonomic chair is meant to facilitate an upright and comfortable posture for the person sitting on it, the person sitting on it still has a bent posture, as the person is not utilizing the backrest."
    ]
  ],
  "20240101_172417.jpg": [
    [
      "20240101_182531.jpg",
      "The image is satirical because even though the mobile phone has been developed to be very slim, it requires frequent recharging which makes the mobile phone useless without a big, heavy and thick power bank."
    ],
    [
      "20240101_172834.jpg",
      "the irony in this image is that the seat right above a bus' wheels is the most uncomfortable one."
    ]
  ],
  "20240101_182549.jpg": [
    [
      "20240101_180844.jpg",
      "The image is ironic, because the left door of the car is easily opened with still space left so the car could have been parked more on the left whereas the right door of the car is getting stuck due to the less space between the two cars and the person in facing difficulty in getting himself out but person on the left easily gets out"
    ],
    [
      "20240101_173054.jpg",
      "The overall image is ironical because the people who claim to be anticapitalist are the ones with a lot of capital as shown here. While the woman supports anticapitalism as shown by the sticker on the back of her laptop, she has a phone, a camera and a laptop all of which require money."
    ]
  ],
  "20240101_172843.jpg": [
    [
      "20240101_180754.jpg",
      "The images are ironic since even though e-tickets are provided to save resources like paper, people choose to print out e-tickets on large sheets of paper which leads to more wastage"
    ],
    [
      "20240101_173542.jpg",
      "The image is ironical, as people can be seen in the beach, and is clearly not a secret, while the board at the entrance has \"Secret Beach\" written on it."
    ]
  ],
  "20240101_175339.jpg": [
    [
      "20240101_172348.jpg",
      "The image is ironic, because in the first image a person is seen watching his decorated X-mas tree but in the second image it is shown that the tree is looking beautiful not due to its natural beauty but the bulbs connected via power decorated over it"
    ],
    [
      "20240101_181457.jpg",
      "The image is of a metro or railway station which shows that the person in left is standing in the middle at the correct place to board the train, but in the right, the doors of the train are wronglyÃ\u0082Â positioned"
    ]
  ],
  "20240101_173341.jpg": [
    [
      "20240101_175353.jpg",
      "The same sea which gives us a relaxation on a normal day can pose a danger to us sometimes like during a tsunami"
    ],
    [
      "20240101_172731.jpg",
      "Image is funny because the box of salad was marketed in a way that showed a lot more salad content than was really present inside it."
    ]
  ],
  "20240101_182235.jpg": [
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ],
    [
      "20240101_173141.jpg",
      "The images are ironic since we work to improve technology and build innovations like robots, but in the process we ourselves become less human and robotic in the way we function."
    ]
  ],
  "20240101_174629.jpg": [
    [
      "20240101_173813.jpg",
      "The image is ironical, as even though the ergonomic chair is meant to facilitate an upright and comfortable posture for the person sitting on it, the person sitting on it still has a bent posture, as the person is not utilizing the backrest."
    ],
    [
      "20240101_173752.jpg",
      "The image is funny, as there are two electrical sockets side-by-side, but the adapter is shaped in such a way, that if two adapters are inserted into the two sockets, they will butt into each other, leading to inconvenience."
    ]
  ],
  "20240101_182545.jpg": [
    [
      "20240101_173542.jpg",
      "The image is ironical, as people can be seen in the beach, and is clearly not a secret, while the board at the entrance has \"Secret Beach\" written on it."
    ],
    [
      "20240101_173159.jpg",
      "The images are ironic because even though garbage bins are provided for humans to dispose waste, by habit humans still choose to make surroundings dirty by disposing garbage improperly"
    ]
  ],
  "20240101_180312.jpg": [
    [
      "20240101_173317.jpg",
      "The images are funny since a man trying to reduce his irritation by killing a mosquito bothering  him only causes himself more irritation by soiling his t-shirt with the mosquito blood"
    ],
    [
      "20240101_174241.jpg",
      "The image is ironic, because even when the person has a large collection of shoes even then he is not able to basket a ball in a small height net"
    ]
  ],
  "20240101_172947.jpg": [
    [
      "20240101_180844.jpg",
      "The image is ironic, because the left door of the car is easily opened with still space left so the car could have been parked more on the left whereas the right door of the car is getting stuck due to the less space between the two cars and the person in facing difficulty in getting himself out but person on the left easily gets out"
    ],
    [
      "20240101_173054.jpg",
      "The overall image is ironical because the people who claim to be anticapitalist are the ones with a lot of capital as shown here. While the woman supports anticapitalism as shown by the sticker on the back of her laptop, she has a phone, a camera and a laptop all of which require money."
    ]
  ],
  "20240101_181415.jpg": [
    [
      "20240101_182506.jpg",
      "The image is funny, as when looking from the front, girl's pants are spick and span, while looking from the back, her pants are soaked in water, probably due to walking on a road filled with water in high heels. This is ironical, as the very reason for wearing heels (i.e. looking beautiful) is defeated, due to the heels themselves."
    ],
    [
      "20240101_172414.jpg",
      "This is funny because on the one hand this person is feeling very cold and has his jacket all the way up to his face, but on the other hand his trousers are torn which kind of makes the jacket redundant."
    ]
  ],
  "20240101_180958.jpg": [
    [
      "20240101_180947.jpg",
      "The images are ironic since they show how a man supposedly cares for ducks since he stops his vehicle to give way to queue of ducks allowing them to safely cross a road but on the other hand he goes to a peking duck shop to buy and eat similar ducks after having them killed"
    ],
    [
      "20240101_182503.jpg",
      "The image is ironic, because some people like to enjoy watching the biodiversity under water but they are not able to explore this due to excess crowd in such places where people like to play, swim etc. in water"
    ]
  ],
  "20240101_180501.jpg": [
    [
      "20240101_172414.jpg",
      "This is funny because on the one hand this person is feeling very cold and has his jacket all the way up to his face, but on the other hand his trousers are torn which kind of makes the jacket redundant."
    ],
    [
      "20240101_173552.jpg",
      "The images are funny since it shows how someone has put effort into a cup of coffee to do latte art on it only for it to be invisible after a lid is put on the coffee cup before serving to a customer"
    ]
  ],
  "20240101_174213.jpg": [
    [
      "20240101_175155.jpg",
      "The images are funny since they show how even though the hired movers achieve their task of moving in furniture, in the process, the cause damage to the whole house"
    ],
    [
      "20240101_182638.jpg",
      "The image is ironic, because in the left image as in the logo it shows happy chicken but in the right image the chicken pieces are shown packed in boxes"
    ]
  ],
  "20240101_175745.jpg": [
    [
      "20240101_182531.jpg",
      "The image is satirical because even though the mobile phone has been developed to be very slim, it requires frequent recharging which makes the mobile phone useless without a big, heavy and thick power bank."
    ],
    [
      "20240101_180636.jpg",
      "The image is ironic, because as the singer is performing in an orchestra but because there is so much crowd people at the back are not able to get a clear view of the singer"
    ]
  ],
  "20240101_174958.jpg": [
    [
      "20240101_172940.jpg",
      "The irony is that the boy is petting the cow to show that he cares about the animal, but then he also eats hamburgers made from the same cows"
    ],
    [
      "20240101_172838.jpg",
      "The image is ironic, as the t-shirt that says \"NONBINARY\" has only 2 options for gender on an online retail forum."
    ]
  ],
  "20240101_172944.jpg": [
    [
      "20240101_173748.jpg",
      "The images are funny since they show how women plan out holidays with much care but their menstrual cycles ruin their plans by causing trouble due to bleeding and discomfort that occur during menstruation"
    ],
    [
      "20240101_173624.jpg",
      "The images are ironic since they show how even though electric powered cars are touted to be a game changer in the automotive industry and claims are made that they will make the world a greener and cleaner place to live in, the reality is quite different. Battery production causes vast amounts of pollution making such claims very doubtful"
    ]
  ],
  "20240101_182503.jpg": [
    [
      "20240101_182604.jpg",
      "The image is ironic, because in the first image in the bathroom there are so many things to clean hands around the basin but in the same bathroom people have to open the doors by hand which can easily spread the germs or bacteria even after times of hand cleaning as there is no way to open it without hands"
    ],
    [
      "20240101_180501.jpg",
      "The images are funny because it shows the same body in two different lighting conditions, one where it appears muscular and one where it does not appear so. It shows how we can make the same thing appear appealing to others without it being as appealing in real life"
    ]
  ],
  "20240101_174123.jpg": [
    [
      "20240101_173054.jpg",
      "The overall image is ironical because the people who claim to be anticapitalist are the ones with a lot of capital as shown here. While the woman supports anticapitalism as shown by the sticker on the back of her laptop, she has a phone, a camera and a laptop all of which require money."
    ],
    [
      "20240101_174757.jpg",
      "The images are funny since it shows a woman simply sipping from a cup at ease in a cafe with her laptop not caring about anything going on outside the cafe even though the situation is very grave,that is, a nuclear blast"
    ]
  ],
  "20240101_172902.jpg": [
    [
      "20240101_180658.jpg",
      "The images are ironic since paper straws were invented to reduce use of plastic in the form of plastic straws. However, these straws come in plastic packages and are served with plastic cups, defeating  the purpose"
    ],
    [
      "20240101_174237.jpg",
      "The image is funny, as the traffic light for pedestrains is red, even though it is at a zebra crossing, which does not need a red light for stopping a pedestrain from crossing. Also, there are no people or vehicles around, which makes the image even funnier."
    ]
  ],
  "20240101_182541.jpg": [
    [
      "20240101_173112.jpg",
      "The images are ironic since it shows how a holiday destination for a woman and a man is actually a workplace for many others where they are toiling away everyday"
    ],
    [
      "20240101_173921.jpg",
      "The image is funny, as the weather is sunny during the weekdays, which are generally the days when people work in a job. People look forward to go outside and enjoy in the weekend, but due to an unexpected rainy weather, people will not be able to go outside."
    ]
  ],
  "20240101_175119.jpg": [
    [
      "20240101_175339.jpg",
      "The image is funny because while the bed seems to be well made with the blanket on top, the actual blanket inside the blanket cover is twisted and not properly set."
    ],
    [
      "20240101_180952.jpg",
      "The image is funny because while the umbrella helps a person avoid getting wet from rain, when the rain stops and the umbrella is folded, the wet umbrella iteself drips water on the person holding it."
    ]
  ],
  "20240101_174848.jpg": [
    [
      "20240101_175535.jpg",
      "The images are funny since they show how wearing expensive football boots does not make the user a better footballer. The footballer is still just as bad and it is a waste for him to buy such expensive boots"
    ],
    [
      "20240101_174518.jpg",
      "The image is ironic, because the people who get sentimental over imprisoned animal while watching TV shows often feel okay when using animals for labor"
    ]
  ],
  "20240101_174107.jpg": [
    [
      "20240101_174848.jpg",
      "The images are funny since the show people end up using disposable razors for so long that they need not dispose it anymore."
    ],
    [
      "20240101_175820.jpg",
      "The image is ironical, as the relaxation kit is meant to relax and calm down the person using it during a bath, but the showering area is an enclosed space, which might instead tense up someone, especially if the person is claustrophobic."
    ]
  ],
  "20240101_173748.jpg": [
    [
      "20240101_174629.jpg",
      "The images are funny since they show how close the user is to hitting his daily target of 10000 steps, but as soon as it is midnight, the step counter resets and the user misses his daily target by one step. Once the clock resets he is 9999 steps away from his target"
    ],
    [
      "20240101_172357.jpg",
      "The image is funny because while the room has a big TV with a big screen, the movie being played on it does not use the entire screen."
    ]
  ],
  "20240101_172315.jpg": [
    [
      "20240101_172731.jpg",
      "Image is funny because the box of salad was marketed in a way that showed a lot more salad content than was really present inside it."
    ],
    [
      "20240101_172354.jpg",
      "The image is ironical, as the t-shirt says \"We work jobs we hate, to buy sh*t we don't need\", which is a rebellious message against the construct of office jobs. However, the person wearing the t-shirt seems to be working in an office environment. Also, the t-shirt might have been bought using the money earned via the very same job."
    ]
  ],
  "20240101_174548.jpg": [
    [
      "20240101_174119.jpg",
      "The image is ironical, as the person is believes that \"You Only Live Once\" (as can be seen from the t-shirt), and hence drinks and parties a lot, and is dead probably due to drug overdose. However, it is shown that the person re-incarnates as a crying baby, which goes against the person's belief."
    ],
    [
      "20240101_180754.jpg",
      "The images are ironic since even though e-tickets are provided to save resources like paper, people choose to print out e-tickets on large sheets of paper which leads to more wastage"
    ]
  ],
  "20240101_173000.jpg": [
    [
      "20240101_172357.jpg",
      "The image is funny because while the room has a big TV with a big screen, the movie being played on it does not use the entire screen."
    ],
    [
      "20240101_175023.jpg",
      "This image is ironical, as a bottle of mineral water is being used along with ice cubes from tap water, while the sama tap water could have been instead used."
    ]
  ],
  "Screenshot_2024-01-01-18-12-18-789_com.twitter.android-edit.jpg": [
    [
      "20240101_172955.jpg",
      "The image is funny, as the drink seems to be full to begin with, while most of the volume of the drink is occupied by the ice cubes."
    ],
    [
      "20240101_173326.jpg",
      "The images are funny since it shows how people tend to forget the important details like names of presidents but remember the useless ones, like forgetting names of presidents but remembering the names of their exes in this example"
    ]
  ],
  "20240101_173013.jpg": [
    [
      "20240101_173955.jpg",
      "The man is wearing a swimming cap to protect his head's hair but on the other side he is not concerned over the hair all over his body and is nowhere covering them"
    ],
    [
      "20240101_174123.jpg",
      "The image is ironical beaucse while the boy does not enjoy studying mathematics and different geometric shapes like semi circle and trapezoid and graphs of trigonometric equations like that of a sine wave, he enjoys skateboarding on surfaces and bowls that are built based on the said geometric shapes and graphs of trigonometric equations."
    ]
  ],
  "20240101_180636.jpg": [
    [
      "20240101_182235.jpg",
      "The image is ironic, because in the first image the tattoo of a snake on someone's hand may give us a hint about how powerful or brave the person can be who is having this tattoo but in the second image the person with same tattoo is seen frightened due to a snake in his house"
    ],
    [
      "20240101_180958.jpg",
      "The images are funny since even it shows how even though modern cars are fitted with features like reverse camera, drivers still choose to not use it and reverse the old fashioned way by looking behind"
    ]
  ],
  "20240101_175859.jpg": [
    [
      "20240101_172420.jpg",
      "The image is ironic, because it shows over modernization, earlier the size was printed on the label attached to the clothes but now for knowing even the basic details about the cloth like size there is some barcode or QR code attached which need to be scanned by some mobile phone or electronic device"
    ],
    [
      "20240101_181316.jpg",
      "The images are funny since even though a cat tree is bought for cats to play with, cats would usually rather play with inexpensive cardboard boxes because they enjoy it more"
    ]
  ],
  "20240101_172834.jpg": [
    [
      "20240101_180643.jpg",
      "The image is ironic, because there are many different color currency notes' bundles but they are just as a currency in the game of monopoly and they have no real value"
    ],
    [
      "20240101_175231.jpg",
      "The irony here is that people buy phones with flashy camera systems just to click pictures of random and insignificant things."
    ]
  ],
  "20240101_173205.jpg": [
    [
      "20240101_175558.jpg",
      "The image is ironical, as vegan mayo sauce is being poured on rib steak, which is non-vegetarian. The person might as well just use normal mayo sauce instead."
    ],
    [
      "20240101_180607.jpg",
      "Women wear netted tops while out in the sun on the beach as a beachwear, but when the person removes it, the skin is tanned in the same netted pattern looks weird, and goes against the purpose of using it as beachwear"
    ]
  ],
  "20240101_174025.jpg": [
    [
      "20240101_182526.jpg",
      "This image may present two different ideas, firstly even she is such a believer in god that she has got a tatto of holy cross symbol on her back but her situations have forced her to do a job at a bar or some place performing pole dance and secondly she is using a religious symbol to glorify her look so that more people acknowledge her dance and give her some money"
    ],
    [
      "Screenshot_2024-01-01-17-38-54-117_com.twitter.android-edit.jpg",
      "The images are ironic since it shows how women are represented in our society. When it comes to a men's boxing match, a woman in revealing clothes is expected to hold out boards depicting round numbers but in a women's boxing match, they do not expect men to do so. It is poking fun at the gender roles that exist in our society"
    ]
  ],
  "20240101_172350.jpg": [
    [
      "20240101_181343.jpg",
      "The image is ironical, as person without hair is sad in a normal situation due to the absence of hair, unlike other people with hair. However, in a swimming pool, people with hair have to wear swimming caps, which is uncomfortable, while the person without hair does not need a cap, and is thus, happy in this situation."
    ],
    [
      "20240101_180335.jpg",
      "The image is satirical because even thought the woman is not able to eat food with chopstick properly, she chooses it over fork and knife to look sophisticaed."
    ]
  ],
  "20240101_173017.jpg": [
    [
      "20240101_174232.jpg",
      "The image is funny because while walk signs are very useful for pedestrians to be able to cross roads safely, the become unnecessary and annoying for car drivers when these signals turn green even when there is no pedestrian tring to cross the road."
    ],
    [
      "20240101_173729.jpg",
      "The image is ironic, because in the left image she is seen how sincere she is about keeping her home clean but in the right image she forgets these principles while travelling in the car"
    ]
  ],
  "20240101_172932.jpg": [
    [
      "20240101_181457.jpg",
      "The image is of a metro or railway station which shows that the person in left is standing in the middle at the correct place to board the train, but in the right, the doors of the train are wronglyÃ\u0082Â positioned"
    ],
    [
      "20240101_182503.jpg",
      "The image is ironic, because some people like to enjoy watching the biodiversity under water but they are not able to explore this due to excess crowd in such places where people like to play, swim etc. in water"
    ]
  ],
  "20240101_172407.jpg": [
    [
      "20240101_182638.jpg",
      "The image is ironic, because in the left image as in the logo it shows happy chicken but in the right image the chicken pieces are shown packed in boxes"
    ],
    [
      "20240101_173108.jpg",
      "The image is ironic, because the mountaineer climbs up the mountain to view the world from the peak but due to so much cloud, at the top, nothing is visible whereas he was able to witness some awesome views while climbing up the mountain"
    ]
  ],
  "20240101_180403.jpg": [
    [
      "20240101_173108.jpg",
      "The image is ironic, because the mountaineer climbs up the mountain to view the world from the peak but due to so much cloud, at the top, nothing is visible whereas he was able to witness some awesome views while climbing up the mountain"
    ],
    [
      "20240101_173332.jpg",
      "This is ironic because the person joining the big social group, presumably interested in the happenings of that group, motivated to engage with these people, MUTEs the group as soon as they join it, indicating they are not interested in it and do not  want to be bothered by it.  These actions are contradictory from a social perspective, and illuminate a weird fact about present day online life."
    ]
  ],
  "20240101_173214.jpg": [
    [
      "20240101_173104.jpg",
      "The images are funny since they show how a woman chooses to spend time clicking pictures of her food and by the time she is done, the food is already cold and not as appetizing as it was"
    ],
    [
      "20240101_173700.jpg",
      "the irony in this image is that people waste pizza crust by saying that it is too hard, while they eat hard chocolate without any complaints"
    ]
  ],
  "20240101_173542.jpg": [
    [
      "20240101_172928.jpg",
      "The images are funny since they show how a jumbled rubiks cube appears solved simply because of the viewers perspective."
    ],
    [
      "20240101_173332.jpg",
      "This is ironic because the person joining the big social group, presumably interested in the happenings of that group, motivated to engage with these people, MUTEs the group as soon as they join it, indicating they are not interested in it and do not  want to be bothered by it.  These actions are contradictory from a social perspective, and illuminate a weird fact about present day online life."
    ]
  ],
  "20240101_173642 (1).jpg": [
    [
      "20240101_181343.jpg",
      "The image is ironical, as person without hair is sad in a normal situation due to the absence of hair, unlike other people with hair. However, in a swimming pool, people with hair have to wear swimming caps, which is uncomfortable, while the person without hair does not need a cap, and is thus, happy in this situation."
    ],
    [
      "20240101_172325.jpg",
      "The images are ironic since they show how putting a lot of lights as decorations on trees make them beautiful to look at for us but cause trouble to the birds who actually live on trees for no good reason"
    ]
  ],
  "20240101_180601.jpg": [
    [
      "20240101_172834.jpg",
      "the irony in this image is that the seat right above a bus' wheels is the most uncomfortable one."
    ],
    [
      "20240101_173525.jpg",
      "the irony in this image is a small thing like a medicine very often has instructions and a manual that is extremely long"
    ]
  ],
  "20240101_173007.jpg": [
    [
      "20240101_181101.jpg",
      "the image is funny, as from the front, the woman is apparently slim, but she looks chubby from the side."
    ],
    [
      "20240101_175445.jpg",
      "The image is ironical, as a team and its are all celebrating on the ground after winning the match, but after the match, the fans are standing in the bus uncomfortably, while the players are travelling inside a carring the cup as well as the prize money, which the fans did not get a dime of."
    ]
  ],
  "20240101_173355.jpg": [
    [
      "20240101_180340.jpg",
      "The image is ironical, as an inanimate box of building blocks has been secured by the seatbelt in the backseat of a car, while a person sitting in the backseat is not wearing the seatbelt, while the person would actually need the seatbelt in case there is an accident."
    ],
    [
      "20240101_173647.jpg",
      "The image is ironic, as the person is holding the game console to play a game during the flight. However, the person is unable to play the game, as the game requires internet (as is the case with many modern games), and internet is unavailable in many lights."
    ]
  ],
  "20240101_173712.jpg": [
    [
      "20240101_181404.jpg",
      "The image is ironical, as the social ,edia post shows the appreciation of nature, while an image of the feet on the ground stepping on the flower petals shows an unintentional disrespect of nature."
    ],
    [
      "20240101_175535.jpg",
      "The images are funny since they show how wearing expensive football boots does not make the user a better footballer. The footballer is still just as bad and it is a waste for him to buy such expensive boots"
    ]
  ],
  "20240101_180751.jpg": [
    [
      "20240101_175730.jpg",
      "when we drink the whole soup, then  it is very healthy. But people eliminate some things which they don't like."
    ],
    [
      "20240101_180345.jpg",
      "The image is ironic, because the person has to travel 2 hours just to ride his bicycle for 17 minutes"
    ]
  ],
  "20240101_175208.jpg": [
    [
      "20240101_174232.jpg",
      "The image is funny because while walk signs are very useful for pedestrians to be able to cross roads safely, the become unnecessary and annoying for car drivers when these signals turn green even when there is no pedestrian tring to cross the road."
    ],
    [
      "20240101_180407.jpg",
      "The images are funny since it show a woman holding a leaf over half of her face for a good photo but unknown to her is thale fact the same leaf might have been defecated or urinated upon by dogs and other wild animals"
    ]
  ],
  "20240101_173144.jpg": [
    [
      "Screenshot_2024-01-01-18-15-32-614_com.twitter.android-edit.jpg",
      "The image is ironic, because in the first image a statue is shown with smiling face pointing in some direction but in the second image the same statue is seen as pointing at the wrong path which can cause accidents that too with the smiling face"
    ],
    [
      "20240101_175135.jpg",
      "The image is ironic, because even when the signal is green for the pedestrians but they can't cross the road because of the vehicles standing on the zebra crossing"
    ]
  ],
  "20240101_173411.jpg": [
    [
      "20240101_180345.jpg",
      "The image is ironic, because the person has to travel 2 hours just to ride his bicycle for 17 minutes"
    ],
    [
      "20240101_182604.jpg",
      "The image is ironic, because in the first image in the bathroom there are so many things to clean hands around the basin but in the same bathroom people have to open the doors by hand which can easily spread the germs or bacteria even after times of hand cleaning as there is no way to open it without hands"
    ]
  ],
  "20240101_174544.jpg": [
    [
      "20240101_172924.jpg",
      "The irony in the image is that the mug is supposedly cute and quirky but it is completely impractical as a mug as it will hurt its user."
    ],
    [
      "20240101_181319.jpg",
      "The image is ironic, because people often use rowing machine at the gym don't prefer rowing when it comes to boats"
    ]
  ],
  "20240101_173239.jpg": [
    [
      "20240101_180751.jpg",
      "The image is ironical, as salad in a bowl by itself is very healthy. However, when people have it with Mayonnaise sauce to improve the taste, it is not healthy anymore, and defeats the point of having nutrient-rich salad altogether."
    ],
    [
      "20240101_180636.jpg",
      "The image is ironic, because as the singer is performing in an orchestra but because there is so much crowd people at the back are not able to get a clear view of the singer"
    ]
  ],
  "20240101_180548.jpg": [
    [
      "20240101_175759.jpg",
      "The image is ironic, because in the first image it shows that someone plan their life in a to-do list but as the future is unknown anyone can never be sure whether he/she can complete their to-do lists"
    ],
    [
      "20240101_180501.jpg",
      "The images are funny because it shows the same body in two different lighting conditions, one where it appears muscular and one where it does not appear so. It shows how we can make the same thing appear appealing to others without it being as appealing in real life"
    ]
  ],
  "20240101_175627.jpg": [
    [
      "20240101_175820.jpg",
      "The image is ironical, as the relaxation kit is meant to relax and calm down the person using it during a bath, but the showering area is an enclosed space, which might instead tense up someone, especially if the person is claustrophobic."
    ],
    [
      "20240101_174232.jpg",
      "The image is funny because while walk signs are very useful for pedestrians to be able to cross roads safely, the become unnecessary and annoying for car drivers when these signals turn green even when there is no pedestrian tring to cross the road."
    ]
  ],
  "20240101_182511.jpg": [
    [
      "20240101_182545.jpg",
      "The image is funny because while there is an offer that lets the buyer have a free item if they buy two items of the product, there is only two units left which means that the buyer won't get the free unit."
    ],
    [
      "Screenshot_2024-01-01-17-38-54-117_com.twitter.android-edit.jpg",
      "The images are ironic since it shows how women are represented in our society. When it comes to a men's boxing match, a woman in revealing clothes is expected to hold out boards depicting round numbers but in a women's boxing match, they do not expect men to do so. It is poking fun at the gender roles that exist in our society"
    ]
  ],
  "20240101_172336.jpg": [
    [
      "20240101_175738.jpg",
      "The image is ironic, because a person is seen feeling proud over the profit earned over his investment but the right image shows the whole story how only a small part of his investment journey is shown and the other loss part is ignored"
    ],
    [
      "20240101_173748.jpg",
      "The images are funny since they show how women plan out holidays with much care but their menstrual cycles ruin their plans by causing trouble due to bleeding and discomfort that occur during menstruation"
    ]
  ],
  "20240101_182552.jpg": [
    [
      "20240101_174021.jpg",
      "The images are ironic since the metallic water bottle aims to be more sustainable as can be seen from the sign on the bottle but its user fills it with a plastic bottle which destroys its purpose"
    ],
    [
      "20240101_175009.jpg",
      "The images are funny since the .png image of the hat is supposed to have a transparent background but when the image is used for editing a mans picture it is seen that the background is not actually transparent and it ends up covering the face of the man in the other picture."
    ]
  ],
  "20240101_175942.jpg": [
    [
      "20240101_175413.jpg",
      "This is funny because the pie chart printout is useless as you cant see any divisions on it because the  printer could not capture the different colors"
    ],
    [
      "20240101_175445.jpg",
      "The image is ironical, as a team and its are all celebrating on the ground after winning the match, but after the match, the fans are standing in the bus uncomfortably, while the players are travelling inside a carring the cup as well as the prize money, which the fans did not get a dime of."
    ]
  ],
  "20240101_173718.jpg": [
    [
      "20240101_182519.jpg",
      "The images are funny since even though someone like \"Bob\" shows support for free speech as a civil right, he is not ready to deal with the consequences of free speech and chooses to not be spoken to by certain people. He thus blocks people from contacting him on his phone."
    ],
    [
      "20240101_172339.jpg",
      "The image is ironical, as the person wearing a formal black suit and pants, is wearing colorful socks, probably due to the reason that socks are not visible while wearing shoes, and hence, do not need to be formal."
    ]
  ],
  "20240101_173029.jpg": [
    [
      "20240101_180345.jpg",
      "The image is ironic, because the person has to travel 2 hours just to ride his bicycle for 17 minutes"
    ],
    [
      "20240101_180403.jpg",
      "The images are funny since they show how a workspace has installed drinking water dispenser but it is of no use since the water cup dispenser is left empty"
    ]
  ],
  "20240101_173756.jpg": [
    [
      "20240101_174147.jpg",
      "The image is ironic, because in the first image there are many memes on men but in the second image a person is seen raising voice over some meme on woman and calling it as woman bully but no one raises their voice against memes over man calling them as man bully"
    ],
    [
      "20240101_181316.jpg",
      "The images are funny since even though a cat tree is bought for cats to play with, cats would usually rather play with inexpensive cardboard boxes because they enjoy it more"
    ]
  ],
  "20240101_174021.jpg": [
    [
      "20240101_173748.jpg",
      "The images are funny since they show how women plan out holidays with much care but their menstrual cycles ruin their plans by causing trouble due to bleeding and discomfort that occur during menstruation"
    ],
    [
      "20240101_173024.jpg",
      "The image is funny because while from the distance it seems that the man has big tattoos on both of his arms upon a closer look at the arms it turns out there is no tattoo and what seemed to be tattoos are just hairs on his arm."
    ]
  ],
  "20240101_175752.jpg": [
    [
      "20240101_173317.jpg",
      "The images are funny since a man trying to reduce his irritation by killing a mosquito bothering  him only causes himself more irritation by soiling his t-shirt with the mosquito blood"
    ],
    [
      "20240101_175558.jpg",
      "The image is ironical, as vegan mayo sauce is being poured on rib steak, which is non-vegetarian. The person might as well just use normal mayo sauce instead."
    ]
  ],
  "20240101_174232.jpg": [
    [
      "20240101_173141.jpg",
      "The images are ironic since we work to improve technology and build innovations like robots, but in the process we ourselves become less human and robotic in the way we function."
    ],
    [
      "20240101_181054.jpg",
      "The image is funny because while the man does not like the boy playing music loudly on his phone, the man himself is okay with doing the same thing with his car and playing loud music in the car with the sound coming out of the car."
    ]
  ],
  "20240101_180509.jpg": [
    [
      "20240101_172339.jpg",
      "The image is ironical, as the person wearing a formal black suit and pants, is wearing colorful socks, probably due to the reason that socks are not visible while wearing shoes, and hence, do not need to be formal."
    ],
    [
      "20240101_173718.jpg",
      "The image just speaks yes, but in a different way as \"yes, butt\" like in the early morning the man had to look at the cat's butt because it is standing over the man's body"
    ]
  ],
  "20240101_180455.jpg": [
    [
      "20240101_180545.jpg",
      "The image is funny because while the man claims to be vegan, he is biting skin off his own hand."
    ],
    [
      "20240101_173624.jpg",
      "The images are ironic since they show how even though electric powered cars are touted to be a game changer in the automotive industry and claims are made that they will make the world a greener and cleaner place to live in, the reality is quite different. Battery production causes vast amounts of pollution making such claims very doubtful"
    ]
  ],
  "20240101_174200.jpg": [
    [
      "20240101_174029.jpg",
      "The images are ironic since they show how on one hand humans choose to play with and waste foods like vegetables while the animals are unable to eat enough food and end up starving due to lack of food"
    ],
    [
      "20240101_180758.jpg",
      "The image is ironic, because in the first image a toy, purposed for the cat to play with is shown but in the second image the cat is comfortably enjoying  to play on the sides of sofa"
    ]
  ],
  "20240101_175331.jpg": [
    [
      "20240101_173638.jpg",
      "The image is funny because a well-built person wearing an aggressive tank-top with the word \"KILL\" on an image of a skull is having very childish flavours of whey protein such as teddy vanilla, yummy yummy choco, and strawberry vanilla, contrary to the person's external persona. This depicts the metaphor 'Do not judge a book by its cover'."
    ],
    [
      "20240101_180407.jpg",
      "The images are funny since it show a woman holding a leaf over half of her face for a good photo but unknown to her is thale fact the same leaf might have been defecated or urinated upon by dogs and other wild animals"
    ]
  ],
  "20240101_173955.jpg": [
    [
      "20240101_173054.jpg",
      "The overall image is ironical because the people who claim to be anticapitalist are the ones with a lot of capital as shown here. While the woman supports anticapitalism as shown by the sticker on the back of her laptop, she has a phone, a camera and a laptop all of which require money."
    ],
    [
      "20240101_173317.jpg",
      "The images are funny since a man trying to reduce his irritation by killing a mosquito bothering  him only causes himself more irritation by soiling his t-shirt with the mosquito blood"
    ]
  ],
  "20240101_180159.jpg": [
    [
      "20240101_182503.jpg",
      "The image is ironic, because some people like to enjoy watching the biodiversity under water but they are not able to explore this due to excess crowd in such places where people like to play, swim etc. in water"
    ],
    [
      "20240101_182506.jpg",
      "The image is funny, as when looking from the front, girl's pants are spick and span, while looking from the back, her pants are soaked in water, probably due to walking on a road filled with water in high heels. This is ironical, as the very reason for wearing heels (i.e. looking beautiful) is defeated, due to the heels themselves."
    ]
  ],
  "20240101_172940.jpg": [
    [
      "20240101_173039.jpg",
      "The image is funny because while the girls loves the man, he likes other men instead of women."
    ],
    [
      "20240101_180026.jpg",
      "The images are ironic since a dog shampoo bottle has a sticker indicating that it has not been tested on animals and hence might not be safe for animal use. It is amusing that a product designed to be used by animals is not tested on animals for their safety"
    ]
  ],
  "20240101_180545.jpg": [
    [
      "20240101_175048.jpg",
      "The image is ironical because in the left image it is written eco bag but in the right image we are keeping items of plastic which is not eco-friendly."
    ],
    [
      "20240101_174853.jpg",
      "The image is ironic, because on the one side tetra packs have cap or lid for opening but on the other side the folded end seems inconvenient to handle"
    ]
  ],
  "20240101_175247.jpg": [
    [
      "20240101_175217.jpg",
      "The image is ironic, because in the first image the woman is showing how she is enjoying the sea trip but whereas the second image shows how she is struggling over the trip due to sea sickness which brings up a contrast comparison between the two photos"
    ],
    [
      "20240101_174123.jpg",
      "The image is ironical beaucse while the boy does not enjoy studying mathematics and different geometric shapes like semi circle and trapezoid and graphs of trigonometric equations like that of a sine wave, he enjoys skateboarding on surfaces and bowls that are built based on the said geometric shapes and graphs of trigonometric equations."
    ]
  ],
  "20240101_173401.jpg": [
    [
      "20240101_174927.jpg",
      "The image is ironical, as a woman is sitting by the sink taking a selfie using a mirror, while not using a chair that is actually meant for sitting."
    ],
    [
      "20240101_182519.jpg",
      "The images are funny since even though someone like \"Bob\" shows support for free speech as a civil right, he is not ready to deal with the consequences of free speech and chooses to not be spoken to by certain people. He thus blocks people from contacting him on his phone."
    ]
  ],
  "20240101_182526.jpg": [
    [
      "20240101_175541.jpg",
      "The image is ironical, as the cans of paint used to make graffiti on the theme \"Save the Earth\" seems to be destroying the Earth when it overflows on the grass, as it is harmful for the flora and fauna, as can be seen from the dying insects."
    ],
    [
      "20240101_174949.jpg",
      "the irony is that dog owners buy loads of toys for their dog but the dog's favourite toy is the owner's slippers"
    ]
  ],
  "20240101_180247.jpg": [
    [
      "20240101_173642 (1).jpg",
      "The image is ironic, because even when there are steel frame baskets are available at the supermarkets people prefer carrying the items in hand"
    ],
    [
      "20240101_175155.jpg",
      "The images are funny since they show how even though the hired movers achieve their task of moving in furniture, in the process, the cause damage to the whole house"
    ]
  ],
  "20240101_182531.jpg": [
    [
      "20240101_175752.jpg",
      "The image is funny because while the woman is concerned about protection from the sun rays, she is not concerned about her safety while riding a scooter."
    ],
    [
      "20240101_174107.jpg",
      "The image is ironic, because the person who cries over the scratches on his car but applies stickers on his car happily which is quite dual nature of the person"
    ]
  ],
  "20240101_173326.jpg": [
    [
      "Screenshot_2024-01-01-17-55-08-129_com.twitter.android~2.jpg",
      "The images are funny since even though a woman goes for a full body massage expecting it to soothe her whole body, the design of a massage table is such that no matter how badly her nose itches, she cannot scratch it to soothe herself"
    ],
    [
      "20240101_180802.jpg",
      "The image is ironic, because in the left image the man is showing love and care for the puppy but in the right image the same puppy is shown to be chained in a kennel, which shows dual nature of human towards animals"
    ]
  ],
  "20240101_175614.jpg": [
    [
      "20240101_180927.jpg",
      "Although the children is hiding his children's eyes from a women but he himself is roaming in shirt open which is showing his body."
    ],
    [
      "20240101_182552.jpg",
      "The image is funny because while the food for the dog that the woman pours is well balanced, the food that she herself is eating is bad for her health."
    ]
  ],
  "20240101_175126.jpg": [
    [
      "20240101_172913.jpg",
      "The image is funny, as the person entering the Halloween Party has a costume that is identical to many other people in the party."
    ],
    [
      "20240101_173135.jpg",
      "The image is ironic, because some person is trying to plug out one pin from the multi pin plug but due to tight fitting the multi pin plug socket itself is getting pulled off disconnecting the power supply to other devices even when it is not required"
    ]
  ],
  "20240101_175135.jpg": [
    [
      "20240101_172951.jpg",
      "The image is ironic, because the sole purpose of the person was to get a hair cut but he became so much engrossed in the game that the barber wasn't able to cut his hairs properly. and even the saloon is providing so many facilities but they don't have a good hairdresser"
    ],
    [
      "20240101_174147.jpg",
      "The image is ironic, because in the first image there are many memes on men but in the second image a person is seen raising voice over some meme on woman and calling it as woman bully but no one raises their voice against memes over man calling them as man bully"
    ]
  ],
  "20240101_174000.jpg": [
    [
      "20240101_180407.jpg",
      "The images are funny since it show a woman holding a leaf over half of her face for a good photo but unknown to her is thale fact the same leaf might have been defecated or urinated upon by dogs and other wild animals"
    ],
    [
      "20240101_173039.jpg",
      "The image is funny because while the girls loves the man, he likes other men instead of women."
    ]
  ],
  "20240101_174903.jpg": [
    [
      "20240101_180032.jpg",
      "The images are funny since they show how people are more worried about small damages to  things they can replace like cars but are not worried about permanent damages to their own health"
    ],
    [
      "20240101_172853.jpg",
      "The images are funny since the show how even though refrigerator manufacturers design in-built egg trays, they are of no use to users who choose to put their entire box of eggs in the refrigerator"
    ]
  ],
  "20240101_175836.jpg": [
    [
      "20240101_180643.jpg",
      "The image is ironic, because there are many different color currency notes' bundles but they are just as a currency in the game of monopoly and they have no real value"
    ],
    [
      "20240101_175627.jpg",
      "The image is funny, as the person is trying to operate the tap, but water comes out of the handheld shower resting on a holder instead of the tap, making the person drenched in water."
    ]
  ],
  "20240101_175048.jpg": [
    [
      "20240101_172414.jpg",
      "This is funny because on the one hand this person is feeling very cold and has his jacket all the way up to his face, but on the other hand his trousers are torn which kind of makes the jacket redundant."
    ],
    [
      "20240101_182333.jpg",
      "This is funny, because the machine while doing its job cleans everything but ends up being dirty itself."
    ]
  ],
  "20240101_180407.jpg": [
    [
      "20240101_181251.jpg",
      "The image is funny, as the driver of the car inserts a CD named \"Favorite Songs\" into the CD player for the passenger, but the driver is sad on seeing the passenger in the back seat listening to something else on earphones instead."
    ],
    [
      "20240101_180706.jpg",
      "The image is funny because the Hotel's name suggests that it is very good and as it's name itself is Hotel 5 stars but in reality it received a rating of only 3.7 out of 5"
    ]
  ],
  "20240101_175554.jpg": [
    [
      "20240101_182426.jpg",
      "The image is ironical, as the folder icons on the desktop screen are very neatly arranged, while the person using the computer has littered the table with used food packets, dirty plates, and wrappers."
    ],
    [
      "20240101_182604.jpg",
      "The image is ironic, because in the first image in the bathroom there are so many things to clean hands around the basin but in the same bathroom people have to open the doors by hand which can easily spread the germs or bacteria even after times of hand cleaning as there is no way to open it without hands"
    ]
  ],
  "20240101_180758.jpg": [
    [
      "20240101_174237.jpg",
      "The image is funny, as the traffic light for pedestrains is red, even though it is at a zebra crossing, which does not need a red light for stopping a pedestrain from crossing. Also, there are no people or vehicles around, which makes the image even funnier."
    ],
    [
      "20240101_172354.jpg",
      "The image is ironical, as the t-shirt says \"We work jobs we hate, to buy sh*t we don't need\", which is a rebellious message against the construct of office jobs. However, the person wearing the t-shirt seems to be working in an office environment. Also, the t-shirt might have been bought using the money earned via the very same job."
    ]
  ],
  "20240101_173100.jpg": [
    [
      "20240101_175445.jpg",
      "The image is ironical, as a team and its are all celebrating on the ground after winning the match, but after the match, the fans are standing in the bus uncomfortably, while the players are travelling inside a carring the cup as well as the prize money, which the fans did not get a dime of."
    ],
    [
      "Screenshot_2024-01-01-17-38-54-117_com.twitter.android-edit.jpg",
      "The images are ironic since it shows how women are represented in our society. When it comes to a men's boxing match, a woman in revealing clothes is expected to hold out boards depicting round numbers but in a women's boxing match, they do not expect men to do so. It is poking fun at the gender roles that exist in our society"
    ]
  ],
  "20240101_173254.jpg": [
    [
      "20240101_173003.jpg",
      "The images are funny since they show how a peaceful sight like a woman painting a natural scenery looks good only from afar. When looked closely we can see details like flies on the painting which make us uneasy and the scene is not so good to look at anymore."
    ],
    [
      "20240101_173605.jpg",
      "This image is ironical, as a person holding up a \"Free Hugs\" sign is standing alone, while an inanimate Wi-fi Router giving \"Free Wifi\" is surrounded people trying to connect to it. This shows a growing lack of empathy in our society, while showing our increasing dependence on the digital devices in a virtual world."
    ]
  ],
  "20240101_173706.jpg": [
    [
      "20240101_173029.jpg",
      "The irony in this image describes shrinkflation, which is when stores start selling big bags of products with less product in them."
    ],
    [
      "20240101_173936.jpg",
      "The image is funny because while the playlist is labelled \"music I love\" indicating that all the music in the playlist is very well liked by the user but the user is pressing play next button after listening to a few seconds of one of the audios in the playlist."
    ]
  ],
  "20240101_180649.jpg": [
    [
      "20240101_180155.jpg",
      "The image is ironic, because an old man with good looking clothes, symbolising him as rich, is showing a quote on the difficulty for a rich man to gain eternal life whereas the man has both long life meaning eternal life and good clothes meaning rich"
    ],
    [
      "20240101_175247.jpg",
      "The image is funny because the object which is said to be fragile by the tape turns out to be an equipment to practice punches and kicks on meaning that it is very tought and sturdy."
    ]
  ],
  "20240101_172317.jpg": [
    [
      "20240101_182545.jpg",
      "The image is funny because while there is an offer that lets the buyer have a free item if they buy two items of the product, there is only two units left which means that the buyer won't get the free unit."
    ],
    [
      "20240101_175820.jpg",
      "The image is ironical, as the relaxation kit is meant to relax and calm down the person using it during a bath, but the showering area is an enclosed space, which might instead tense up someone, especially if the person is claustrophobic."
    ]
  ],
  "20240101_172420.jpg": [
    [
      "20240101_173605.jpg",
      "This image is ironical, as a person holding up a \"Free Hugs\" sign is standing alone, while an inanimate Wi-fi Router giving \"Free Wifi\" is surrounded people trying to connect to it. This shows a growing lack of empathy in our society, while showing our increasing dependence on the digital devices in a virtual world."
    ],
    [
      "20240101_173007.jpg",
      "The image is ironical, as the umbrella is meant to provide shadow in the area where the chairs are present, but due to the orientation of the rays of the sun, all the chairs are in sunlight, and the umbrella is of no use in this situation."
    ]
  ],
  "20240101_182451.jpg": [
    [
      "20240101_172325.jpg",
      "The images are ironic since they show how putting a lot of lights as decorations on trees make them beautiful to look at for us but cause trouble to the birds who actually live on trees for no good reason"
    ],
    [
      "20240101_181415.jpg",
      "The image is funny because the full plate of cookies is hiding the entire nutrition facts leading readers to believe that the entire box of cookies amounts to just 160 calories but when all the cookies are eaten and the plate is empty, the rest of the nutrition table is visible which tells that each serving of cookies amounts to 160 calories where one serving consists of 3 cookies."
    ]
  ],
  "20240101_181143.jpg": [
    [
      "20240101_173119.jpg",
      "The image is confusing, as initially, when the label reads \"Blue Cat\", the people are happy and are petting tha cat, but as soon as one of them realizes that the entire text reads \"Russian Blue Cat\", they seem to worried, and one of them throws away the cat. For some reason, the word \"Russian\" is a trigger word for them."
    ],
    [
      "20240101_172951.jpg",
      "The image is ironic, because the sole purpose of the person was to get a hair cut but he became so much engrossed in the game that the barber wasn't able to cut his hairs properly. and even the saloon is providing so many facilities but they don't have a good hairdresser"
    ]
  ],
  "20240101_181316.jpg": [
    [
      "20240101_174719.jpg",
      "The image is ironic, because even when the pigeon has wings to fly it is walking even when it seems threatening to its life"
    ],
    [
      "20240101_180509.jpg",
      "The image overall is funny because even though people have great music studios and instruments to create and record music, they use electronic replacements of the musical instruments to achieve the task."
    ]
  ],
  "20240101_174842.jpg": [
    [
      "20240101_173401.jpg",
      "The images are funny since it shows how even though sweaters and other clothings provide much comfort, a tiny manufacturers tag ends up causing the user a lot of discomfort due to constant scratching"
    ],
    [
      "20240101_180403.jpg",
      "The images are funny since they show how a workspace has installed drinking water dispenser but it is of no use since the water cup dispenser is left empty"
    ]
  ],
  "20240101_175535.jpg": [
    [
      "20240101_181009.jpg",
      "The image is ironic, because people set such a strong passwords for their accounts that they even forget the password and need to reset them"
    ],
    [
      "20240101_182448.jpg",
      "The image is funny because even though the trolley bag is made to make carrying luggage easy, as soon as it encounters a rough surface like cobblestone road, it makes carrying luggage more difficult."
    ]
  ],
  "20240101_182629.jpg": [
    [
      "20240101_182511.jpg",
      "The image is ironic, because in the second image it is shown that a group of people is attending someone's death ceremony but one of them is shown as wrongly dressed for that place in first image, his visual appearances doesn't shows his feeling of mourning"
    ],
    [
      "20240101_180912.jpg",
      "The image is satirical because while the man has visited all the place marked on the map, he only seems to have swam in pools in all these differnt countries and has not actually seen these places."
    ]
  ],
  "20240101_174134.jpg": [
    [
      "20240101_180618.jpg",
      "The images are funny since they show how a sender wants the recipient to revert once he gets back home but the tired recipient ends up falling asleep completely forgetting about the message while the sender keeps waiting for a reply. The fact that the recipient leaves his phone on silent mode makes it even funnier since the probability of the sender being able to contact him becomes even slimmer."
    ],
    [
      "20240101_174813.jpg",
      "The image is ironic, because in the first image a woman is seen enjoying her coffee, while watching the injustice happening outside without even having a single thought on the injustice outside and taking some actions or raising some concerns over it"
    ]
  ],
  "20240101_181001.jpg": [
    [
      "20240101_172417.jpg",
      "The image is ironical, as a person sets a strong password for Wifi, while setting a very simple 4-digit PIN (1234 here) for online banking, where a much higher level of security would be required instead."
    ],
    [
      "20240101_172400.jpg",
      "This image is funny because images of very regular things - a stick figure and a bicycle, get converted into  looking phallic from a distance."
    ]
  ],
  "20240101_172858.jpg": [
    [
      "20240101_175119.jpg",
      "The image is ironic, because in the first image some musical band is showing its poster of world tour but in the right image only a few countries are highlighted as tour countries"
    ],
    [
      "20240101_180649.jpg",
      "The image is funny becuase while folding the side mirrors is good when the car is not being used because it prevents damage but it is supposed to be used while driving and parking the car which has not been done in this case leading the car to be parked impropely."
    ]
  ],
  "20240101_173332.jpg": [
    [
      "20240101_182338.jpg",
      "The image is ironical, as the smartwatch on the person's wrist shows 10,000 steps completed as an accomplishment, while showing later that the person is apparently walking inside a jail as a prisoner."
    ],
    [
      "20240101_173936.jpg",
      "The image is funny because while the playlist is labelled \"music I love\" indicating that all the music in the playlist is very well liked by the user but the user is pressing play next button after listening to a few seconds of one of the audios in the playlist."
    ]
  ],
  "20240101_174949.jpg": [
    [
      "20240101_181143.jpg",
      "The image is ironical such that although there is a place for parking but that place is not suitable because if we place our car there then our car will become dirty from top due to crow beet."
    ],
    [
      "20240101_181439.jpg",
      "The image is ironical, as having breakfast in bed is a luxury. However, eating while in bed leads to food crumbs, making the bed dirty, along with the need to clean the bed afterwards."
    ]
  ],
  "20240101_174147.jpg": [
    [
      "20240101_175820.jpg",
      "The image is ironical, as the relaxation kit is meant to relax and calm down the person using it during a bath, but the showering area is an enclosed space, which might instead tense up someone, especially if the person is claustrophobic."
    ],
    [
      "20240101_180754.jpg",
      "The images are ironic since even though e-tickets are provided to save resources like paper, people choose to print out e-tickets on large sheets of paper which leads to more wastage"
    ]
  ],
  "20240101_182242.jpg": [
    [
      "20240101_173232.jpg",
      "The action scenes of the movies or TV programs are mostly low in sound and people aren't able to hear them properly but in the action scenes due to the background music and other noise the sound becomes unbearable to some peoples"
    ],
    [
      "20240101_173654.jpg",
      "The image is ironic, as the text on the pack reads 'invisible tape', but the tape inside it is actually visible."
    ]
  ],
  "20240101_172928.jpg": [
    [
      "20240101_173039.jpg",
      "The image is funny because while the girls loves the man, he likes other men instead of women."
    ],
    [
      "20240101_180754.jpg",
      "The images are ironic since even though e-tickets are provided to save resources like paper, people choose to print out e-tickets on large sheets of paper which leads to more wastage"
    ]
  ],
  "20240101_182604.jpg": [
    [
      "20240101_173205.jpg",
      "The image is ironic, because"
    ],
    [
      "Screenshot_2024-01-01-17-59-17-340_com.twitter.android-edit.jpg",
      "The image is funny because while the intention of getting a cycling exercise machine is to do workout, it is being used for hanging clothes and other things on it."
    ]
  ],
  "20240101_173112.jpg": [
    [
      "20240101_182448.jpg",
      "The image is funny because even though the trolley bag is made to make carrying luggage easy, as soon as it encounters a rough surface like cobblestone road, it makes carrying luggage more difficult."
    ],
    [
      "20240101_180932.jpg",
      "The image is ironical, as to clear the phone's memory using phone cleaner app, one has to install it, but that is not possible in turn due to the phone memory being full."
    ]
  ],
  "20240101_175953.jpg": [
    [
      "20240101_172412.jpg",
      "The images are ironic, since they show how men protest against abortion of babies but they choose to leave instead of taking care of the babies once they are born leaving the mother with neither a choice or support for raising a child"
    ],
    [
      "20240101_172414.jpg",
      "This is funny because on the one hand this person is feeling very cold and has his jacket all the way up to his face, but on the other hand his trousers are torn which kind of makes the jacket redundant."
    ]
  ],
  "20240101_180932.jpg": [
    [
      "20240101_172858.jpg",
      "The image is ironic, because on one side the same person throws pumpkin seeds out of pumpkin into dustbin when brought at home but he is eating the package pumpkin seeds"
    ],
    [
      "20240101_172834.jpg",
      "the irony in this image is that the seat right above a bus' wheels is the most uncomfortable one."
    ]
  ],
  "20240101_173654.jpg": [
    [
      "Screenshot_2024-01-01-18-12-18-789_com.twitter.android-edit.jpg",
      "the irony in this image is that people say that they like to read things while they instantly skip reading the terms and conditions when registering for anything online."
    ],
    [
      "20240101_180247.jpg",
      "the irony in this image is that people ignore all the chaos around them and get distracted by a cat."
    ]
  ],
  "20240101_173433.jpg": [
    [
      "20240101_173955.jpg",
      "The man is wearing a swimming cap to protect his head's hair but on the other side he is not concerned over the hair all over his body and is nowhere covering them"
    ],
    [
      "20240101_174927.jpg",
      "The image is ironical, as a woman is sitting by the sink taking a selfie using a mirror, while not using a chair that is actually meant for sitting."
    ]
  ],
  "20240101_173638.jpg": [
    [
      "20240101_182545.jpg",
      "The image is funny because while there is an offer that lets the buyer have a free item if they buy two items of the product, there is only two units left which means that the buyer won't get the free unit."
    ],
    [
      "20240101_172357.jpg",
      "The image is funny because while the room has a big TV with a big screen, the movie being played on it does not use the entire screen."
    ]
  ],
  "20240101_174536.jpg": [
    [
      "20240101_175647.jpg",
      "The image is ironical, as even though the art studio contains a palette of a range of color paints, the painting on the canvas is black and white."
    ],
    [
      "20240101_173024.jpg",
      "The image is funny because while from the distance it seems that the man has big tattoos on both of his arms upon a closer look at the arms it turns out there is no tattoo and what seemed to be tattoos are just hairs on his arm."
    ]
  ],
  "20240101_174540.jpg": [
    [
      "20240101_173123.jpg",
      "The image is funny, as the person has a ticket of a seat that is on the leftmost end of the gallery. However, the person has entered from the other end, and is going through a sea of seated people to get to the vacant seat. This would cause inconvenience to the people in the row, and would probably take a longer time to reach the seat."
    ],
    [
      "20240101_175752.jpg",
      "The image is funny because while the woman is concerned about protection from the sun rays, she is not concerned about her safety while riding a scooter."
    ]
  ],
  "20240101_173123.jpg": [
    [
      "20240101_174540.jpg",
      "The image is ironic because even though a boxer has won the match and it is supposed to be a moment of celebration, the boxer got bruised in several places during the match. This is an illustration of what hurdles a person has to go through in order to succeed."
    ],
    [
      "20240101_173108.jpg",
      "The image is ironic, because the mountaineer climbs up the mountain to view the world from the peak but due to so much cloud, at the top, nothing is visible whereas he was able to witness some awesome views while climbing up the mountain"
    ]
  ],
  "20240101_181251.jpg": [
    [
      "20240101_180851.jpg",
      "The Picture shows that although we enjoy food in garden but there are some consequences of eating food in garden. Many bugs and bees are attracted towards our food and make our food sometimes non-eatable."
    ],
    [
      "20240101_180751.jpg",
      "The image is ironical, as salad in a bowl by itself is very healthy. However, when people have it with Mayonnaise sauce to improve the taste, it is not healthy anymore, and defeats the point of having nutrient-rich salad altogether."
    ]
  ],
  "20240101_175558.jpg": [
    [
      "20240101_174000.jpg",
      "Although the person has purchased a king size bed, but only less than half of the space is used by the person for sleeping."
    ],
    [
      "20240101_182503.jpg",
      "The image is ironic, because some people like to enjoy watching the biodiversity under water but they are not able to explore this due to excess crowd in such places where people like to play, swim etc. in water"
    ]
  ],
  "20240101_175722.jpg": [
    [
      "20240101_172902.jpg",
      "The images are funny since they show how new hairstyles are closely resembling pattern baldness"
    ],
    [
      "20240101_180758.jpg",
      "The image is ironic, because in the first image a toy, purposed for the cat to play with is shown but in the second image the cat is comfortably enjoying  to play on the sides of sofa"
    ]
  ],
  "20240101_182338.jpg": [
    [
      "Screenshot_2024-01-01-18-15-32-614_com.twitter.android-edit.jpg",
      "The image is ironic, because in the first image a statue is shown with smiling face pointing in some direction but in the second image the same statue is seen as pointing at the wrong path which can cause accidents that too with the smiling face"
    ],
    [
      "20240101_182246.jpg",
      "The image is funny, as when making a strawberry cake using  a recipe book, the outcome is not quite what is expected, and one has to wash the used utensils afterwards as well."
    ]
  ]
}